Repository: colobot/colobot-data
Catalog: levels/scene3-po/*.po
Languages: fr

source: scene300:On Tropica
fr: scene300:Sur Tropica

source: scene301:The Trap
fr: scene301:Le piège

source: scene301:Explore a tropical paradise looking for an explosive device.
fr: scene301:Explorez un paradis tropical à la recherche d'une caisse d'explosifs.

source: scene302:Amnesia
fr: scene302:Amnésique

source: scene302:Find your spaceship in the Tropica maze.
fr: scene302:Retrouvez le vaisseau spatial dans un labyrinthe végétal.

source: scene303:On the Offensive
fr: scene303:A l'attaque

source: scene303:Develop an offensive weapons system and confront the giant ants.
fr: scene303:Développez un système d'armement offensif pour pouvoir faire face aux fourmis géantes.

source: scene304:Shooting Drill #1
fr: scene304:Exercice

source: scene304:Sharpen your flying and shooting skills.
fr: scene304:Exercice de pilotage et de tir simultané.

source: scene305:Black Box
fr: scene305:Boîte noire

source: scene305:Explore the underwater world looking for another black box.
fr: scene305:Explorez les fonds marins à la recherche d'une boîte noire.
