Repository: colobot/colobot-data
Catalog: levels/missions/chapter009/level003/po/*.po
Languages: fr

source: Gold Digger
fr: La troisième clé

source: Be prepared to dig for buried treasure.
fr: Récupérez la troisième clé.

source: From Mission Control
fr: Instructions de Houston

source: The third <a object|key>key</a> (C) is buried in a mushroom-infested area. A <a object|botss>sniffer</a> should be able to locate it and a <a object|derrick>derrick</a> should be able to extract it.
fr: La troisième <a object|key>clé</a> a été enterrée par la première expédition dans un "endroit riche en champignons". Un <a object|botss>robot renifleur</a> devrait pouvoir la détecter, et un <a object|derrick>derrick</a> pourra la remonter à la surface.

source: When your mission is completed and before taking off, bring both <a object|botshld>shielder</a> and <a object|botsub>subber</a> aboard your spaceship.
fr: Avant de décoller, pensez à prendre avec vous le <a object|botshld>robot bouclier</a> et le <a object|botsub>sous-marin</a>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
fr: <format key><key help/></format> permet de revoir ces instructions sur votre SatCom.

source: See also
fr: Voir aussi

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
fr: <a command>Commandes</a>.

source: Programs dispatched by Houston
fr: Programme envoyé par Houston

source: We did not develop a specific program for this mission. However, you can develop your own programs if you think it would be useful.
fr: Nous ne vous avons envoyé aucun programme pour cette mission. A vous de faire ceux qui peuvent vous rendre service!

source: Index of the programs dispatched in former missions:
fr: Résumé des programmes déjà reçus:

source: <code><a mlvolca2>ServiceTower1</a></code>
fr: <code><a mlvolca2>ServiceTour1</a></code>

source: <code><a mlvolca1>CollectTitanium3</a></code>
fr: <code><a mlvolca1>ApporteTitanium3</a></code>

source: <code><a mlsaari2>KillAnt1</a></code>
fr: <code><a mlsaari2>TueFourmi1</a></code>

source: <code><a mlcrys2>CollectTitanium2</a></code>
fr: <code><a mlcrys2>ApporteTitanium2</a></code>

source: <code><a mlcrys1>CollectTitanium1</a></code>
fr: <code><a mlcrys1>ApporteTitanium1</a></code>

source: <code><a mllune1>SwitchCell1</a></code>
fr: <code><a mllune1>EchangePile1</a></code>

source: Satellite Report
fr: Rapport du satellite

source: Currently in a geo-stationary orbit of Terranova.
fr: En orbite géostationnaire autour de Terranova.

source: \tab;Temperature: 26.1C \tab;Atmosphere: oxygen \tab;Wind: 0.4 mps \tab;Titanium ore: some \tab;Uranium ore: some
fr: \tab;Température: 26.1 degrés \tab;Atmosphère: oxygène \tab;Vent: 0.4 m/s \tab;Minerai titanium: par endroits \tab;Minerai uranium: par endroits

source: -> SUBSOIL<c/>
fr: -> SOUS-SOL<c/>

source: \tab;Energy source: none \tab;Titanium ore: none \tab;Uranium ore: none
fr: \tab;Energie: aucune \tab;Minerai titanium: aucun \tab;Minerai uranium: aucun \tab;Clé enterrée: 1

source: -> ADDITIONAL INFORMATION<c/>
fr: -> INFORMATIONS SPECIALES<c/>

source: \tab;Detected: giant ants \tab; - Danger: immediate \tab;Detected: giant wasps \tab; - Danger: immediate
fr: \tab;Détecté: fourmis géantes \tab; - Danger: oui \tab;Détecté: guèpes géantes \tab; - Danger: oui

source: Walkthrough
fr: Solution

source: Unfortunately no walkthrough has been provided for this mission. You are on your own...
fr: Aucune solution n'est disponible pour cette mission. Vous devez vous débrouiller ...

source: <a command>Controls</a>
fr: <a command>Commandes</a>.
