Repository: colobot/colobot-data
Catalog: levels/train3-po/*.po
Languages: fr

source: train300:Fundamentals
fr: train300:Base

source: train301:Follow a path
fr: train301:Suivre un chemin

source: train301:Move the bot along a given path.
fr: train301:Déplacer un robot le long d'une trajectoire donnée.

source: train301:Move
fr: train301:Déplace

source: train302:Follow with variables
fr: train302:Suivre mieux

source: train302:Use variables in order to store the parameters of the path.
fr: train302:Déplacer un robot le long d'une trajectoire donnée, en utilisant des variables.

source: train302:Move
fr: train302:Déplace

source: train303:Use a loop in order to destroy six targets.
fr: train303:Détruire six cibles à l'aide d'une boucle.

source: train304:Exchange posts 1
fr: train304:Bornes 1

source: train304:Collect valuable information from information exchange posts.
fr: train304:Récolter une information de direction, afin d'apprendre le concept de variable.

source: train304:Info
fr: train304:Suivre

source: train305:Exchange posts 2
fr: train305:Bornes 2

source: train305:Collect more valuable information from information exchange posts.
fr: train305:Récolter des informations de direction et de distance, afin d'apprendre le concept de variable.

source: train305:Info
fr: train305:Suivre

source: train306:Labyrinth 1
fr: train306:Labyrinthe 1

source: train306:Teach your bot how to find its way out of the labyrinth.
fr: train306:Programmez un robot pour qu'il avance sans se cogner dans un labyrinthe.

source: train306:Labyrinth
fr: train306:Labyrinthe

source: train307:Labyrinth 2
fr: train307:Labyrinthe 2

source: train307:Teach your bot to do the same job in a more autonomous way.
fr: train307:Programmez un robot pour qu'il avance sans se cogner dans un labyrinthe.

source: train307:Labyrinth
fr: train307:Labyrinthe

source: train308:The gold digger
fr: train308:Le chercheur d'or

source: train308:Instruct your bot to search a zone for subsoil resources.
fr: train308:Recherche de minerai en sous-sol en programmant un robot pour quadriller une zone.

source: train308:Digger
fr: train308:Cherche

source: train309:Remote control #1
fr: train309:Télécommande #1

source: train309:Remote control a robot using an information exchange post, so it will transport uranium ore.
fr: train309:Télécommandez un robot par le biais d'une borne d'information.
