Repository: colobot/colobot-data
Catalog: levels/missions/chapter002/level004/po/*.po
Languages: cs

source: Black Box
cs: Černá skříňka

source: Discover crucial information left behind by the first expedition.
cs: Najděte důležité informace zanechané první výpravou.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: We have no way of being sure where the previous expedition was headed when it left the Moon surface nor why it chose to go wherever it was going.
cs: Nedokážeme s jistotou určit, kam předchozí výprava po opuštění Měsíce zamířila, ani proč se vydala právě tím směrem.

source: Locate the <a object|bbox>black box</a> they must have left behind and bring it back aboard your ship. The black box should contain the coordinates of the next planet the expedition was planning to visit.
cs: Najděte <a object|bbox>černou skříňku</a>, kterou tu určitě zanechali, a přineste ji zpět na palubu rakety. Černá skříňka by měla obsahovat souřadnice další planety, kterou se předchozí výprava chystala prozkoumat.

source: Your bot's <a object|power>power cells</a> are almost entirely empty. Recharging them should be your priority. The observation satellite in orbit indicates that the subsoil in this particular area is loaded with energy. You should therefore be able to build a functional <a object|station>power station</a> on any flat surface.
cs: <a object|power>Baterie</a> Vašich robotů jsou téměř zcela vybité. Dobít je by mělo být Vaším prvořadým cílem. Průzkumný satelit na oběžné dráze hlásí, že geologické podloží v této oblasti je plné energie. Na kterékoliv rovné ploše proto můžete postavit funkční <a object|station>nabíječku</a>.

source: We have developed a program that will recharge the <a object|power>power cell</a> of a bot. Refer to the program page of your SatCom <button 53/>.
cs: Vyvinuli jsme program, který robotovi nabije <a object|power>baterii</a>. Podrobnosti najdete v seznamu programů ve svém SatKomu <button 53/>.

source: Procedure
cs: Postup

source: You first need to build a <a object|convert>converter</a> that converts the chunks of titanium ore already in your possession into usable <a object|titan>titanium cubes</a>.
cs: Nejprve musíte postavit <a object|convert>konvertor</a>, který z dříve nasbíraných kusů titanové rudy vyrobí použitelné <a object|titan>kostky titanu</a>.

source: You should then build both a <a object|station>power station</a> and a <a object|radar>radar</a> which will indicate the location of the black box on your mini map.
cs: Pak byste měli postavit <a object|station>nabíječku</a> a <a object|radar>radar</a>, který označí polohu černé skříňky na Vaší minimapě.

source: With your power cells fully charged, retrieve the black box. It needs to be placed on the <a object|base>spaceship</a> platform for you to be able to take off.
cs: Po nabití baterií vyražte pro černou skříňku. Než budete moci odstartovat, musíte ji položit na palubu <a object|base>rakety</a>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of the Moon.
cs: Aktuálně na stacionární oběžné dráze Měsíce.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: -38.2°C \tab;Atmosphere: none \tab;Wind: 0.0 mps \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Teplota: -38,2 °C \tab;Atmosféra: žádná \tab;Vítr: 0,0 m/s \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: everywhere \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Zdroj energie: všude \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: Walkthrough
cs: Návod

source: Build a converter <button 162/> with the only titanium cube available.
cs: Z jediné dostupné kostky titanu postavte konvertor <button 162/>.

source: Deposit one chunk of titanium ore at a time at the center of the platform and let the converter do the rest.
cs: Doprostřed plošinky konvertoru pokládejte jednu hroudu titanové rudy po druhé a nechte konvertor udělat zbytek.

source: Build a power station <button 164/> with one of the newly converted titanium cubes.
cs: Z jedné čerstvě vyrobené kostky titanu postavte nabíječku <button 164/>.

source: If you don't feel like looking for the black box yourself, build a radar <button 168/> and the box will appear on your mini map somewhere north of your present location, at the bottom of a crater, next to a few derelict spacecraft and debris from the previous expedition.
cs: Pokud se Vám nechce hledat černou skříňku sami, postavte radar <button 168/> a uvidíte ji na minimapě někde na sever od Vaší aktuální pozice, na dně jednoho kráteru poblíž několika vraků a trosek po předchozí výpravě.

source: Place the grabbers at the center of the power station platform to recharge them. The cells should still have a little power left in them, just enough to radio-control the bots onto the platform.
cs: Dojeďte s robotickými rameny doprostřed plošinky nabíječky, abyste je nabili. V bateriích by jim mělo zbývat ještě dost energie, abyste s nimi dojeli na nabíječku.

source: Radio-control the winged grabber to the black box and back.
cs: Doleťte s létajícím ramenem pro černou skříňku a zpět.

source: Gather both grabbers and the black box onto the spaceship platform and climb on board yourself.
cs: Postavte robotická ramena i černou skříňku na palubu rakety a sami také nastupte.

source: Take off.
cs: Odleťte.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
