Repository: colobot/colobot-data
Catalog: levels/train1-po/*.po
Languages: fr

source: train100:Spiders and supply
fr: train100:Araignées et logistique

source: train100:Supply problems and fight against motionless targets
fr: train100:Problèmes de logistique et combat contre des cibles immobiles

source: train101:Spiders 1
fr: train101:Araignées 1

source: train101:Kill three spiders with a small program.
fr: train101:Tuer trois araignées avec un petit programme.

source: train101:Spider1
fr: train101:Araignée1

source: train102:Power Cell 1
fr: train102:Pile 1

source: train102:Instruct a bot to change the power cell of a nearby winged shooter.
fr: train102:Programmer un robot pour qu'il change la pile d'un autre robot

source: train102:Spider2
fr: train102:Pile1

source: train103:Take a chunk of titanium ore and bring it to the converter.
fr: train103:Programmer un robot pour qu'il aille chercher un minerai de titanium et l'amène sur le convertisseur

source: train104:Use the bot's radar to look for the titanium ore and bring it to the converter.
fr: train104:Utiliser le radar pour aller chercher un minerai de titanium

source: train105:Power Cell 2
fr: train105:Pile 2

source: train105:Power all the winged shooters.
fr: train105:Equiper les robots shooters de piles

source: train105:Spider2
fr: train105:Pile2

source: train106:Spiders 2
fr: train106:Araignées 2

source: train106:Use the radar to find and kill all ants.
fr: train106:Tuer plusieurs araignées localisées avec le radar.

source: train106:Spider2
fr: train106:Araignée2

source: train107:Spiders 3
fr: train107:Araignées 3

source: train107:Learn to move the bot so that no spider can escape.
fr: train107:Allez à la rencontre des araignées.

source: train107:Spider3
fr: train107:Araignée3
