Repository: colobot/colobot-data
Catalog: levels/plus/chapter007/level004/po/*.po
Languages: cs

source: New Policies
cs: Nová pravidla

source: Try a more humane method of dealing with insects.
cs: Pokuste se s vetřelci vypořádat trochu humánnějším způsobem.

source: A Word on New Policies
cs: Pár slov ohledně nové směrnice

source: We are sorry to have to bring this to your attention but this seems like a good a time to let you in on a little concern we're having at the moment. There has been a strong reaction in the public opinion and in Congress concerning your systematic termination of the "indigenous inhabitants" of the planets you've been visiting. Congress has chosen to demonstrate its sensitivity to the concerns of the general population.
cs: Neradi Vás o tom informujeme, ale teď je podle nás vhodná doba říct Vám o jedné nepříjemnosti, kterou teď řešíme. Veřejným míněním i Kongresem značně otřásly zprávy, že systematicky likvidujete "domorodé obyvatele" planet, které jste navštívili. Kongres se proto rozhodl předvést, že naslouchá názorům lidu.

source: We hereby relay their new directives and these directives intimate for you to limit the casualties as much as humanly possible. In other words, do your very best to spare the life-forms you encounter from now on. Your mission should of course in no way find itself jeopardized by this new course of action.
cs: Tímto Vám tedy posíláme jejich novou směrnici, která Vám nařizuje omezit ztráty na životech, jak jen to bude možné. Jinými slovy, od teď se snažte co nejvíce vyhýbat násilným střetům s organizmy, na které narazíte. Tento nový postup samozřejmě nesmí nijak ohrozit Vaši misi.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: Your energy resources appear dangerously limited at this time and so is your arsenal but you need to locate and retrieve the previous expedition's <a object|bbox>black box</a> so you can proceed to the next planet.
cs: Vaše výzbroj i zásoby energie jsou v tuto chvíli podle všeho nebezpečně omezené, ale přesto musíte najít a vyzvednout <a object|bbox>černou skříňku</a> po předchozí výpravě, abyste mohli pokračovat na další planetu.

source: We received a piece of information from your predecessors, via the observation satellite, regarding a new type of weaponry they have developed precisely for a predicament such as this one.
cs: Od Vašich předchůdců jsme prostřednictvím průzkumného satelitu dostali popis nového typu zbraně, kterou vyvinuli přesně pro takovéto situace.

source: This weapon will offer you an opportunity to demonstrate your newfound compassion towards <a object|ant>indigenous species</a> for it is not a weapon of mass destruction. What it offers instead, to the best of our knowledge, is an option to incapacitate them, rendering them, if only temporarily, harmless. If this is indeed the case, you'll need to act quickly before they are given a chance to become hostile to you again.
cs: Tato zbraň představuje příležitost názorně předvést své nově nabyté milosrdenství vůči <a object|ant>domorodým tvorům</a>, protože to není zbraň hromadného ničení. Podle všech dostupných informací naopak díky ní můžete nepřátele ochromit, čímž je alespoň dočasně zneškodníte. Pokud je to skutečně tak, budete pak muset jednat rychle, než budou mít čas Vás znovu napadnout.

source: Procedure
cs: Postup

source: Perform the <a object|research>research program</a> and experiment for yourself but don't forget to bring this new weapon back on board. We are very curious to study its workings.
cs: Proveďte potřebný <a object|research>výzkumný program</a> a praktickou zkoušku, ale nezapomeňte tuto novou zbraň vzít s sebou na palubu. Chceme pak důkladně prostudovat její fungování.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Centaury.
cs: Aktuálně na stacionární oběžné dráze Kentaura.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 21.3C \tab;Atmosphere: oxygen, nitrogen, ammonia \tab;Wind: 1.9 mps \tab;Titanium ore: some \tab;Uranium ore: none
cs: \tab;Teplota: 21,3 °C \tab;Atmosféra: kyslík, dusík, čpavek \tab;Vítr: 1,9 m/s \tab;Titanová ruda: trocha \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: none \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Zdroj energie: žádný \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: giant ants \tab; - Danger: not immediate \tab;Detected: derelicts of no particular use
cs: \tab;Nalezeno: obří mravenci \tab; - Nebezpečí: není bezprostřední \tab;Nalezeno: nepoužitelné vraky
