Repository: colobot/colobot-data
Catalog: levels/train5-po/*.po
Languages: fr

source: train500:Mover
fr: train500:Déplacements

source: train500:Move
fr: train500:Déplace

source: train501:Mover 1
fr: train501:Le déménageur 1

source: train501:Retrieve a titanium cube.
fr: train501:Déplacer un cube de métal.

source: train501:Mover
fr: train501:Déplace

source: train502:Mover 2
fr: train502:Le déménageur 2

source: train502:Retrieve several titanium cubes.
fr: train502:Déplacer plusieurs cubes de métal.

source: train502:Mover
fr: train502:Déplace

source: train503:Mover 3
fr: train503:Le déménageur 3

source: train503:Convert some titanium ore to titanium cubes.
fr: train503:Déplacer du minerai pour le convertir en métal.

source: train503:Mover
fr: train503:Déplace

source: train504:Flying mover
fr: train504:Le déménageur volant

source: train504:Move a titanium cube across obstacles.
fr: train504:Déplacer un cube de métal par dessus des obstacles.

source: train504:Mover
fr: train504:Déplace
