Repository: colobot/colobot-data
Catalog: levels/train4-po/*.po
Languages: fr

source: train400:Motors
fr: train400:Moteurs

source: train400:Motor
fr: train400:Moteur

source: train401:Program a progressive deceleration in order to avoid the mines right behind the goal.
fr: train401:Décélération avec commande directe des moteurs.

source: train402:Use the radar to find lots of stupid blue crosses.
fr: train402:Utilisez le radar pour trouver des objets répartis aléatoirement.

source: train402:Find
fr: train402:Cherche

source: train403:Crazy bot
fr: train403:Le petit poucet

source: train403:Use the radar to put some order into a big mess left behind by a crazy bot.
fr: train403:Utilisez le radar pour trouver toutes les marques déposées par le petit poucet.

source: train403:Move
fr: train403:Ramasse

source: train404:Patient hunter
fr: train404:Chasse à l'homme

source: train404:Be patient enough not to waste your ammunitions.
fr: train404:Abattre quatre cibles mouvantes sans gaspiller un seul coup.

source: train404:Patient
fr: train404:Abattre

source: train405:Shadow
fr: train405:Copieur ...

source: train405:Follow a bot, as if you were its shadow.
fr: train405:Suivez un robot, sans le heurter.

source: train405:Follow
fr: train405:Suivre
