Repository: colobot/colobot-data
Catalog: levels/missions/chapter008/level001/po/*.po
Languages: cs

source: Logistics
cs: Zásobování

source: Lay the foundations for a relay station and a refueling station.
cs: Postavte základy přenosové a zásobovací stanice.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: It seems obvious enough that this planet will be no haven for humanity.
cs: Je celkem jasné, že tato planeta lidstvu neposkytne útočiště.

source: Also... we're very sorry to inform you that you may need to exterminate all hostile organisms.
cs: Dále... s lítostí Vám oznamujeme, že asi budete muset zlikvidovat všechny nepřátelské organizmy.

source: The first expedition located <a object|titanore>titanium ore</a> under the surface of Orpheon. The spot is marked with a blue <a object|flag>flag</a>.
cs: První výprava pod povrchem Orfeonu objevila <a object|titanore>titanovou rudu</a>. Poloha ložiska je označena modrou <a object|flag>vlajkou</a>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Orpheon.
cs: Aktuálně na stacionární oběžné dráze Orfeonu.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: -72.8C \tab;Atmosphere: none \tab;Wind: 0.0 mps \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Teplota: -72,8 °C \tab;Atmosféra: žádná \tab;Vítr: 0,0 m/s \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: none \tab;Titanium ore: some (blue flag) \tab;Uranium ore: none
cs: \tab;Zdroj energie: žádný \tab;Titanová ruda: trocha (modrá vlajka) \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: giant ants \tab; - Danger: not immediate \tab;Detected: fierce electromagnetic storms
cs: \tab;Nalezeno: obří mravenci \tab; - Nebezpečí: není bezprostřední \tab;Nalezeno: silné elektromagnetické bouře

source: Walkthrough
cs: Návod

source: Quickly build a <a object|captor>power captor</a> near the blue flag.
cs: Poblíž modré vlajky rychle postavte <a object|captor>hromosvod</a>.

source: Carry some empty <a object|power>power cells</a> under the power captor. When lightning strikes, they will be recharged.
cs: Dovnitř hromosvodu přivezte několik prázdných <a object|power>baterií</a>. Až udeří blesk, nabijí se.

source: Build a <a object|derrick>derrick</a>.
cs: Postavte <a object|derrick>vrtnou věž</a>.

source: Build a <a object|convert>converter</a>.
cs: Postavte <a object|convert>konvertor</a>.

source: Execute the program <code>CollectTitanium3</code> in order to produce <a object|titan>titanium</a>.
cs: Spusťte program <code>CollectTitanium3</code> na výrobu <a object|titan>titanu</a>.

source: Build a <a object|factory>bot factory</a>.
cs: Postavte <a object|factory>továrnu na roboty</a>.

source: Manufacture a <a object|botoj>winged orga shooter</a>.
cs: Vyrobte <a object|botoj>létající biokanón</a>.

source: Build a <a object|radar>radar</a>.
cs: Postavte <a object|radar>radar</a>.

source: Locate and terminate all <a object|ant>ants</a>.
cs: Najděte a zlikvidujte všechny <a object|ant>mravence</a>.

source: 10) Return to your <a object|base>spaceship</a> and take off.
cs: 10) Vraťte se do <a object|base>rakety</a> a odleťte.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>

source: All subsequent buildings should be erected within the <range> <button 41/> covered by the power captor.
cs: Všechny další budovy byste měli stavět uvnitř oblasti <button 41/> chráněné hromosvodem.
