Repository: colobot/colobot-data
Catalog: levels/scene2-po/*.po
Languages: fr

source: scene200:On the Moon
fr: scene200:Sur la Lune

source: scene200:Moon
fr: scene200:Lune

source: scene201:Titanium ore
fr: scene201:Minerai de titanium

source: scene201:Develop flying bots to access essential raw material on the broken Moon surface.
fr: scene201:Développez des robots volants pour pouvoir accéder aux matières premières sur la surface accidentée de la lune.

source: scene202:Flying Drill #1
fr: scene202:Pilotage 1

source: scene202:Sharpen your flying skills.
fr: scene202:Cours de pilotage.

source: scene203:Flying Drill #2
fr: scene203:Pilotage 2

source: scene203:Sharpen your flying skills (cont'd).
fr: scene203:Suite du cours de pilotage.

source: scene204:Black Box
fr: scene204:Boîte noire

source: scene204:Discover crucial information left behind by the first expedition.
fr: scene204:Recherchez la boîte noire de l'expédition précédente pour connaître les coordonnées de la prochaine planète.
