Repository: colobot/colobot-data
Catalog: levels/free-po/*.po
Languages: fr, pl, ru

source: E
fr: F
pl: P
ru: R

source: free100:Leaving Earth
fr: free100:Sur la Terre
pl: free100:Pożegnanie z Ziemią
ru: free100:Покидая землю

source: free100:Earth
fr: free100:Terre
pl: free100:Ziemia
ru: free100:Земля

source: free200:On the Moon
fr: free200:Sur la Lune
pl: free200:Na Księżycu
ru: free200:На Луне

source: free200:Moon
fr: free200:Lune
pl: free200:Księżyc
ru: free200:Луна

source: free300:On Tropica
fr: free300:Sur Tropica
pl: free300:Na Tropice
ru: free300:На Тропике

source: free300:Tropica
pl: free300:Tropika
ru: free300:Тропика

source: free400:On Crystalium
fr: free400:Sur Crystalium
pl: free400:Na Krystalii
ru: free400:На Кристаллиуме

source: free400:Crystalium
pl: free400:Krystalia
ru: free400:Кристаллиум

source: free500:On Saari
fr: free500:Sur Saari
pl: free500:Na Saari
ru: free500:На Саари

source: free500:Saari
ru: free500:Саари

source: free600:On Volcano
fr: free600:Sur Volcano
pl: free600:Na Wulkanii
ru: free600:На Вулкане

source: free600:Volcano
pl: free600:Wulkania
ru: free600:Вулкан

source: free700:On Centaury
fr: free700:Sur Centaury
pl: free700:Na Centurii
ru: free700:На Центавре

source: free700:Centaury
pl: free700:Centuria
ru: free700:Центавр

source: free800:On Orpheon
fr: free800:Sur Orphéon
pl: free800:Na Orfenii
ru: free800:На Орфее

source: free800:Orpheon
fr: free800:Orphéon
pl: free800:Orfenia
ru: free800:Орфей

source: free900:On Terranova
fr: free900:Sur Terranova
pl: free900:Na Nowej Ziemi
ru: free900:На Терранове

source: free900:Terranova
pl: free900:Nowa Ziemia
ru: free900:Терранова
