Repository: colobot/colobot-data
Catalog: colobot/levels/exercises/chapter005/level003/po/*.po
Languages: fr

source: Mover 3
fr: Le déménageur 3

source: Convert some titanium ore to titanium cubes.
fr: Déplacer du minerai pour le convertir en métal.

source: Mover
fr: Déplace

source: Exercise
fr: Exercice

source: Convert some <a object|titanore>titanium ore</a> to <a object|titan>titanium cubes</a>, then drop 2 titanium cubes on the pads whose coordinates are:
fr: Il faut convertir du <a object|titanore>minerai de titanium</a> en <a object|titan>titanium</a>, puis déposer 2 cubes de titanium sur les plates-formes dont les coordonnées sont:

source: The <a object|derrick>derrick</a> extracts titanium ore from the subsoil; you just have to pick it up.
fr: Le <a object|derrick>derrick</a> extrait automatiquement du minerai de titanium, qui ne demande qu'à être ramassé.

source: The <a object|convert>converter</a> converts titanium ore to titanium cubes. Just drop the titanium ore on the platform, move backward, and wait until it has been converted.
fr: Le <a object|convert>convertisseur</a> transforme le minerai en titanium. Pour cela, il suffit de déposer le minerai, de reculer et d'attendre.

source: General principle
fr: Principe

source: Repeat two times :
fr: Répéter 2 fois:

source: Wait until there is some titanium ore.
fr: Attendre tant qu'on ne trouve pas de minerai.

source: Go to the titanium ore.
fr: Aller vers le minerai.

source: Pick it up.
fr: Prendre le minerai.

source: Go to converter.
fr: Aller vers le convertisseur.

source: Drop the titanium ore.
fr: Déposer le minerai.

source: Move back 2.5 meters.
fr: Reculer de 4 mètres.

source: Wait until there is a titanium cube.
fr: Attendre tant qu'on ne trouve pas de titanium.

source: Pick up the titanium cube.
fr: Prendre le titanium.

source: Go to the platform.
fr: Aller sur une plate-forme.

source: Drop the titanium cube.
fr: Déposer le titanium.

source: The program
fr: Solution

source: A <code><a cbot|for>for</a></code> loop allows you to repeat 2 times all the instructions. The titanium ore is not available immediately. You will have to wait until the derrick extracts it. Use a <code><a cbot|do>do</a></code> loop, as follows:
fr: Une boucle <code><a cbot|for>for</a></code> permet de répéter 2 fois l'ensemble des instructions. Le minerai n'est pas forcément disponible tout de suite. Il faut donc attendre que le derrick le produise, ce qui s'effectue avec une boucle <code><a cbot|do>do</a></code> comme suit:

source: do { obj = radar(TitaniumOre); } while ( obj == null );
fr: <c/>do { obj = radar(TitaniumOre); } while ( obj == null );

source: After the loop (when the radar has found one titanium ore), you can go to its location <code>obj.position</code> with the instruction <code><a cbot|goto>goto</a></code>. Use the instruction <code><a cbot|grab>grab</a></code> to grab the titanium ore. Use the following instruction in order to find the converter:
fr: Lorsque la boucle se termine, vous pouvez aller à la position <code>obj.position</code> avec l'instruction <code><a cbot|goto>goto</a></code>. Pour prendre le minerai, utilisez <code><a cbot|grab>grab</a></code>. Pour trouver le convertisseur, il faut utiliser:

source: obj = radar(Converter);
fr: <c/>obj = radar(Converter);

source: After you dropped the ore on the converter, move back 2.5 meters with <code><a cbot|move>move</a>(-2.5)</code>. A second <code>do</code> loop allows you to wait until the titanium cube is available. You must limit the range of the radar to 5m, otherwise you would immediately find the titanium cube that you already dropped on a pad:
fr: Après avoir déposé le minerai sur le convertisseur, reculez de 4 mètres avec <code><a cbot|move>move</a>(-4)</code>. Une deuxième boucle <code>do</code> permet d'attendre la disponibilité du titanium. Attention à limiter la distance maximale du radar à 10 mètres, pour ne pas reprendre du titanium déjà déposé sur une plate-forme:

source: do { obj = radar(Titanium, 0, 360, 0, 5); } while ( obj == null );
fr: <c/>do { obj = radar(Titanium, 0, 360, 0, 10); } while ( obj == null );

source: The <code>x</code> coordinates of the 2 pads are all equal to 10. The <code>y</code> coordinates are respectively -60 and -65. The most efficient way to get the coordinates of the pads is to use the value of <code>i</code> of the <code>for</code> loop that will take successively the values 0 and 1:
fr: Les coordonnées <code>x</code> des 2 plates-formes sont toutes égales à 10. En revanche, les coordonnées <code>y</code> varient de -60 à -65. Une bonne idée pour calculer la position est de faire intervenir la variable <code>i</code> de la boucle <code>for</code>, qui prend les valeurs 0 et 1:

source: dest.x = 10; dest.y = -60-5*i;
fr: <c/>dest.x = 10; dest.y = -60-5*i;

source: It is up to you to finish the program...
fr: A vous de terminer le programme ...

source: See also
fr: Voir aussi

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
fr: <a tremova2>Exercice précédent</a> et <a cbot>programmation</a>.
