Repository: colobot/colobot-data
Catalog: levels/scene7-po/*.po
Languages: fr

source: scene700:On Centaury
fr: scene700:Sur Centaury

source: scene701:Cloning
fr: scene701:Le canon orgaShooter

source: scene701:Reproduce the technology to manufacture an orga shooter yourself.
fr: scene701:Faites les recherches nécessaires pour pouvoir construire des canons orgaShooter.

source: scene702:Target Practice
fr: scene702:Entraînement

source: scene702:Practise shooting with your new orgaball canon.
fr: scene702:Entraînez-vous à tirer avec le nouveau canon orgaShooter.

source: scene703:Cleansing
fr: scene703:Purification

source: scene703:Find the resources you need to eradicate all life in the region.
fr: scene703:A partir de trois fois rien, débrouillez-vous pour tuer tout ce qui bouge.

source: scene704:New Policies
fr: scene704:Halte au massacre

source: scene704:Try a more humane method of dealing with insects.
fr: scene704:Récupérez la boîte noire sans tuer une seule fourmi.

source: scene705:Self-defense
fr: scene705:Légitime défense

source: scene705:Combine defensive and offensive weapons to deal with a massive attack.
fr: scene705:Face à une attaque massive, utilisez une combinaison d'armes défensives et offensives.
