Repository: colobot/colobot-data
Catalog: levels/exercises/chapter006/level001/po/*.po
Languages: ru

source: A function
ru: Функция

source: Create a function in order to make your program shorter.
ru: Создайте функцию, чтобы сделать вашу программу короче.

source: Exercise
ru: Упражнение

source: The <a object|bottr>bot</a> must pass over all the <a object|waypoint>blue crosses</a> on the ground. The way that must be covered is made of two squares. The first one measures 15 meters, the second 25 meters.
ru: <a object|bottr>Бот</a> должен пройти через все <a object|waypoint>Кресты Синие</a> на земле. Путь, который следует преодолеть, состоит из двух квадратов. Первый размером 15 метров, второй 25 метров.

source: General principle
ru: Общий принцип

source: In order to solve this problem, the most efficient solution consists in creating a <a cbot|function>function</a> that instructs the bot to move on a square shape of a certain size. The main program becomes then very simple:<c/>
ru: Для решения этой проблемы наиболее простым является создание <a cbot|function>функции</a>, которая приказывает боту передвигаться по квадрату определённого размера. Главная программа становится очень простой:<c/>

source: You still have to define the function called <code>Square</code>. In order to do this, you will have to write some instructions outside the <a cbot|bloc>block</a> that until now was the frame of each one of your programs. At the very end of the program, after the last closing brace, we will define the function <code>Square</code>. The program will take the following shape:
ru: Вам необходимо объявить функцию под названием <code>Square</code>. Для этого Вам нужно написать некоторые инструкции вне <a cbot|bloc>блока</a>, который был рамками каждой вашей программы. В самом конце программы после последней закрывающей скобки, мы объявим функцию <code>Square</code>. Программа примет следующий вид:

source: extern void object::Function1( ) { <n/>main function ...<code> } void object::Square(float length) { </code>new function ...<c/> }
ru: extern void object::Function1( ) { <n/>главная функция ...<code> } void object::Square(float length) { </code>новая функция ...<c/> }

source: Let us look in detail at the different elements of the declaration of the function <code>Square</code>:
ru: Давайте подробно рассмотрим различные элементы объявления функции <code>Square</code>:

source: <code><a cbot|void>void</a></code> This means that this function will return no value.
ru: <code><a cbot|void>void</a></code> Это значит, что функция не будет возвращать значение.

source: <code><a cbot|object>object</a>::</code> When you write this in front of the function name, you can have access in the function to all the characteristics of the bot, such as <code>position</code>, <code>orientation</code>, etc. In this exercise, this element is not compulsory, as we will not need the characteristics of the bot in the function.
ru: <code><a cbot|object>object</a>::</code> Если Вы напишите это перед названием функции, Вы получаете доступ в функции ко всем характеристикам бота, таким как <code>position</code>, <code>orientation</code>, и т.д. В этом упражнении этот элемент не обязателен, так как нам не понадобятся характеристики бота в функции.

source: <code>Square ( )</code> This is the name of the function. You can call it Square, or any other name.
ru: <code>Square ( )</code> Это название функции. Вы можете назвать её Square, или любым другим названием.

source: <code><a cbot|float>float</a> length</code> Here you define the parameters that the function will get when it is called. The first time the function is actually called with <code>Square(15)</code>, the variable <code>length</code> will contain the value <code>15</code>. The second time, <code>length</code> will contain <code>25</code>.
ru: <code><a cbot|float>float</a> length</code> Здесь Вы определяете параметры, которые получит функция при вызове. При первом вызове функции с помощью <code>Square(15)</code>, переменная <code>length</code> будет содержать значение <code>15</code>. При втором вызове, <code>length</code> будет содержать <code>25</code>.

source: First the main function <code>Function</code> will be executed.
ru: Сначала будет выполнена главная функция <code>Function</code>.

source: At the line <code>Square(15)</code>, the program will follow the red arrow and enter the function <code>Square</code> a first time, <code>length</code> containing <code>15</code>.
ru: В строке <code>Square(15)</code> программа будет следовать за красной стрелкой и входит в функцию <code>Square</code> в первый раз, <code>length</code> содержит <code>15</code>.

source: At the end of the function <code>Square</code>, the program follows the orange arrow and comes back to the main function.
ru: При завершении функции <code>Square</code> программа следует за оранжевой стрелкой и возвращается к главной функции.

source: At the line <code>Square(25)</code>, the program will follow the blue arrow and enter the function <code>Square</code> a second time.
ru: В строке <code>Square(25)</code> программа следует за синей стрелкой и входит в функцию <code>Square</code> во второй раз.

source: At the end of the function <code>Square</code>, the program follows the light blue arrow and comes back to the main function.
ru: При окончании функции <code>Square</code>, программа следует за голубой стрелкой и возвращается к главной функции.

source: In the function <code>Square</code>, use the instructions <code><a cbot|move>move</a></code> and <code><a cbot|turn>turn</a></code>. In order to make it shorter, you can use a <code><a cbot|for>for</a></code> loop, that will repeat the instructions <code><a cbot|move>move</a></code> and <code><a cbot|turn>turn</a></code> 4 times; however, this is not compulsory.
ru: В функции <code>Square</code> используйте инструкции <code><a cbot|move>move</a></code> и <code><a cbot|turn>turn</a></code>. Чтобы сделать её короче, Вы можете использовать цикл <code><a cbot|for>for</a></code>, который повторит инструкции <code><a cbot|move>move</a></code> и <code><a cbot|turn>turn</a></code> 4 раза; но это не обязательно.

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Here is in detail what will happen when the program is executed:
ru: Вот подробное описание того, что произойдёт при выполнении программы:
