Repository: colobot/colobot-data
Catalog: levels/missions/chapter004/level001/po/*.po
Languages: cs

source: Viruses
cs: Viry

source: A new bug threatens all your systems.
cs: Nová hrozba pro všechny Vaše systémy.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: Build a <a object|radar>radar</a> on the highest point in the area. Make sure that the radar will work safely even after your departure to other planets. Your <a object|research>research center</a> should be able to provide a solution.
cs: Postavte <a object|radar>radar</a> na nejvyšším místě v oblasti. Postarejte se, aby radar mohl dál bezpečně fungovat i po Vašem odletu na další planety. <a object|research>Výzkumná stanice</a> by mohla poskytnout řešení.

source: It is possible that the organisms detected are in fact the <a object|worm>worms</a> alluded to by the first expedition. If this is indeed the case, don't be excessively alarmed: they seem fairly harmless to living organisms but could cause the programs of bots and buildings to malfunction through the emission of viruses.
cs: Je možné, že nalezené organizmy jsou ve skutečnosti <a object|worm>červi</a> zmiňovaní první výpravou. Pokud je to opravdu tak, zbytečně se nelekejte: Pro živé organizmy jsou v podstatě neškodní, ale roznášejí viry, které mohou programům robotů a budov způsobit poruchu.

source: Radars not only give you precious information about objects and organisms present in the region, they also relay information to and from the Earth once you have taken off to other planets. It is highly probable that problems with the radar stations built by the first expedition caused the transmission problems that we are aware of.
cs: Radary Vám nedávají jen cenné informace o objektech a organizmech v oblasti, ale po odletu na další planety zajišťují také přenos informací mezi Vámi a Zemí. Je velmi pravděpodobné, že dříve zjištěné výpadky spojení způsobilo selhání radarů postavených první výpravou.

source: In order to help you with the boring task of gathering the necessary raw material, we have developed a program that instructs the <a object|botgr>wheeled grabber</a> to look for <a object|titanore>titanium ore</a> on its own (see the programming page <button 53/>).
cs: Abychom Vám ušetřili otravnou práci se sběrem surovin, vyvinuli jsme program, který pošle <a object|botgr>pojízdné rameno</a> samostatně hledat <a object|titanore>titanovou rudu</a> (podrobnosti najdete v seznamu programů <button 53/>).

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Crystalium.
cs: Aktuálně na stacionární oběžné dráze Krystalia.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 5.4C \tab;Atmosphere: nitrogen \tab;Wind: 0.0 mps \tab;Titanium ore: some \tab;Uranium ore: none
cs: \tab;Teplota: 5,4 °C \tab;Atmosféra: dusík \tab;Vítr: 0,0 m/s \tab;Titanová ruda: trocha \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: none \tab;Titanium ore: data not available \tab;Uranium ore: none
cs: \tab;Zdroj energie: žádný \tab;Titanová ruda: chybí data \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: unidentified organisms \tab; - Danger: ?
cs: \tab;Nalezeno: neidentifikované organizmy \tab; - Nebezpečí: ?

source: Walkthrough
cs: Návod

source: Build a <a object|factory>bot factory</a>.
cs: Postavte <a object|factory>továrnu na roboty</a>.

source: Produce a <a object|botgj>winged grabber</a>.
cs: Vyrobte <a object|botgj>létající rameno</a>.

source: Carry a <a object|titan>titanium cube</a> to the highest point.
cs: Odvezte <a object|titan>kostku titanu</a> na nejvyšší bod.

source: Build a <a object|radar>radar</a> on the spot.
cs: Postavte tam <a object|radar>radar</a>.

source: Build a <a object|research>research center</a> next to the spaceship.
cs: Vedle rakety postavte <a object|research>výzkumnou stanici</a>.

source: Initiate the <defense tower research program> <button 68/>.
cs: Spusťte výzkum obranných věží <button 68/>.

source: Build the <a object|tower>defense tower</a> next to the radar.
cs: Vedle radaru postavte <a object|tower>obrannou věž</a>.

source: When all the worms are destroyed, you can go back to your ship and take off.
cs: Po likvidaci všech červů se můžete vrátit do rakety a odletět.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
