Repository: colobot/colobot-data
Catalog: levels/defi-po/*.po
Languages: fr, ru

source: defi100:Fundamentals
fr: defi100:Base
ru: defi100:Основы

source: defi101:Follow a path
fr: defi101:Suivre un chemin
ru: defi101:Идите по пути

source: defi101:Move the bot along a given path.
fr: defi101:Déplacer un robot le long d'une trajectoire donnée.
ru: defi101:Ведите бота по указанному пути.

source: defi101:Move
fr: defi101:Déplace
ru: defi101:Вперед

source: defi102:Massacre
ru: defi102:Резня

source: defi102:Use a loop in order to destroy four targets.
fr: defi102:Détruire quatre cibles à l'aide d'une boucle.
ru: defi102:Используйте цикл чтобы уничтожить все цели.

source: defi102:Go
ru: defi102:Вперед

source: defi103:Exchange posts 3
fr: defi103:Bornes
ru: defi103:Пункты обмена 3

source: defi103:Collect lots of valuable information from information exchange posts.
fr: defi103:Récolter des informations de direction et de distance.
ru: defi103:Соберите много разнообразной информации на постах обмена информацией.

source: defi103:Info
fr: defi103:Suivre
ru: defi103:Инфо

source: defi104:Labyrinth 3
fr: defi104:Labyrinthe
ru: defi104:Лабиринт 3

source: defi104:Teach your bot how to find its way out of the labyrinth.
fr: defi104:Programmez un robot pour qu'il avance sans se cogner dans un labyrinthe.
ru: defi104:Научите своего бота найти выход из лабиринта.

source: defi104:Labyrinth
fr: defi104:Labyrinthe
ru: defi104:Лабиринт

source: defi200:Motors
fr: defi200:Moteurs
ru: defi200:Двигатели

source: defi200:Motor
fr: defi200:Moteur
ru: defi200:Мотор

source: defi201:Crazy bot 2
fr: defi201:Le petit poucet
ru: defi201:Сумасшедний бот 2

source: defi201:Use the radar to put some order into a big mess left behind by a crazy bot.
fr: defi201:Utilisez le radar pour trouver toutes les marques déposées par le petit poucet.
ru: defi201:Используйте радар, чтобы навести порядок в большой свалке, оставленной после сумасшедшего бота.

source: defi201:Radar
fr: defi201:Ramasse
ru: defi201:Радар

source: defi202:Shadow 2
fr: defi202:Copieur ...
ru: defi202:Тень 2

source: defi202:Follow a bot, as if you were its shadow.
fr: defi202:Suivez un robot, sans le heurter.
ru: defi202:Следуйте за ботом, как будто вы его тень.

source: defi202:Follow
fr: defi202:Suivre
ru: defi202:Следовать

source: defi203:Help
fr: defi203:Au secours
ru: defi203:Помощь

source: defi203:Defend yourself agains all alien attacks.
fr: defi203:Défendez-vous de toutes les attaques ennemies.
ru: defi203:Отражайте все атаки пришельцев.

source: defi203:Defense
fr: defi203:Protect
ru: defi203:Защита

source: defi204:Radar and traps 1
fr: defi204:Radar et pièges 1
ru: defi204:Радар и ловушки 1

source: defi204:Use your radar to look for various items, but watch out for the mines.
fr: defi204:Utilisez le radar pour trouver des objets répartis aléatoirement, en évitant les bombes.
ru: defi204:Используйте радар, чтобы искать различные предметы, но не наступите на мины.

source: defi204:Traps
fr: defi204:Cherche
ru: defi204:Ловушки

source: defi205:Radar and traps 2
fr: defi205:Radar et pièges 2
ru: defi205:Радар и ловушки 2

source: defi205:Try to figure out how to survive in a hostile environment.
fr: defi205:A vous d'imaginer comment survivre dans un milieu hostile.
ru: defi205:Попытайтесь выжить во враждебном окружении.

source: defi205:Traps
fr: defi205:Cherche
ru: defi205:Ловушки

source: defi300:Mover
fr: defi300:Déplacements
ru: defi300:Переселенец

source: defi300:Move
fr: defi300:Déplace
ru: defi300:Движение

source: defi301:Mover 1
fr: defi301:Le déménageur 1
ru: defi301:Переселенец 1

source: defi301:Retrieve some titanium ore in order to convert it to titanium cubes.
fr: defi301:Déplacer du minerai pour le convertir en métal.
ru: defi301:Добудьте некоторое количество титановой руды, чтобы выплавить из нее титановые слитки.

source: defi301:Mover
fr: defi301:Déplace
ru: defi301:Переселенец

source: defi302:Mover 2
fr: defi302:Le déménageur 2
ru: defi302:Переселенец 2

source: defi302:Try to figure out how to move the titanium cube across obstacles.
fr: defi302:Déplacer un cube de métal par dessus des obstacles.
ru: defi302:Попытайтесь научиться перетащить титановые слитки через преграды.

source: defi302:Mover
fr: defi302:Déplace
ru: defi302:Переселенец

source: defi400:Functions
fr: defi400:Fonctions
ru: defi400:Функции

source: defi401:Function
fr: defi401:Une fonction
ru: defi401:Функция

source: defi401:Create a function to move a bot.
fr: defi401:Créer une fonction pour déplacer un robot.
ru: defi401:Напишите функцию для движения бота.

source: defi401:Move
fr: defi401:Déplace
ru: defi401:Движение

source: defi402:Spiral 2
fr: defi402:La spirale
ru: defi402:Спираль 2

source: defi402:Create a procedure in order to teach your bot to perform a spiral.
fr: defi402:Créer une fonction pour déplacer un robot dans une spirale.
ru: defi402:Напишите процедуру, чтобы научить вашего бота двигаться по спирали.

source: defi402:Move
fr: defi402:Déplace
ru: defi402:Движение
