Repository: colobot/colobot-data
Catalog: levels/plus/chapter002/level001/po/*.po
Languages: cs

source: Titanium ore
cs: Titanová ruda

source: Develop flying bots to access essential raw material on the broken Moon surface.
cs: Vyzkoumejte létající roboty, abyste se na zvrásněném povrchu Měsíce dostali k nezbytným surovinám.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: Collect 4 chunks of <a object|titanore>titanium ore</a> and bring them back aboard your <a object|base>spaceship</a>. Build the equipment necessary for this task (<a object|botgj>flying bots</a>).
cs: Nasbírejte 4 hroudy <a object|titanore>titanové rudy</a> a přivezte je na palubu <a object|base>rakety</a>. Vyrobte si vybavení nezbytné pro splnění úkolu (<a object|botgj>létající roboty</a>).

source: Before you venture any further, you should always take a look at the satellite report <button 186/>.
cs: Než se pustíte do práce, měli byste se vždy podívat na informace ze satelitu <button 186/>.

source: We have transmitted to your <a object|base>spaceship</a> a program that might help you in this task; please refer to the corresponding page of your SatCom with the button <button 53/>.
cs: Poslali jsme Vám program, který Vám může s tímto úkolem pomoci. Podrobnosti si můžete přečíst ve svém SatKomu tlačítkem <button 53/>.

source: Procedure
cs: Postup

source: A new <a object|research>research program</a> is required for winged bots to be added to the list of bots that can be produced by the factory. This research program will also make the propulsion reactor in your personal survival kit operational.
cs: Abyste mohli v továrně vyrábět létající roboty, musíte nejprve spustit další výzkumný program ve <a object|research>výzkumné stanici</a>. Tento program navíc zprovozní tryskový motor, který je součástí Vašeho vybavení pro přežití.

source: Produce a <a object|botgj>winged grabber</a> and collect the 4 chunks of <a object|titanore>titanium ore</a>.
cs: Vyrobte <a object|botgj>létající rameno</a> a nasbírejte 4 hroudy <a object|titanore>titanové rudy</a>.

source: Take the <a object|botgj>winged grabber</a> and the <a object|botgr>wheeled grabber</a> along with you and take off.
cs: Nastupte spolu s <a object|botgj>létajícím ramenem</a> a <a object|botgr>pojízdným ramenem</a> do rakety a odleťte.

source: Be careful that your winged bot does not run out of power when you are far from base. If necessary, replace the <a object|power>power cell</a> before leaving the spaceship. You can either do this manually or you can execute the enclosed program provided by Houston <button 53/>.
cs: Dávejte pozor, aby Vašemu létajícímu robotu nedošla baterie někde daleko od základny. Pokud to bude třeba, vyměňte mu <a object|power>baterii</a> ještě před odletem od rakety. Můžete to udělat ručně, nebo můžete využít program poslaný z Houstonu <button 53/>.

source: In order not to lose your way among the numerous craters on the Moon's surface, use the mini map on the lower right-hand corner of your screen.
cs: Abyste se v bezpočtu kráterů na povrchu Měsíce neztratili, používejte minimapu v pravém dolním rohu obrazovky.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a>
cs: <a command>Ovládání</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of the Moon.
cs: Aktuálně na stacionární oběžné dráze Měsíce.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: -53.1C \tab;Atmosphere: none \tab;Wind: 0.0 mps \tab;Titanium ore: some \tab;Uranium ore: none
cs: \tab;Teplota: -53,1 °C \tab;Atmosféra: žádná \tab;Vítr: 0,0 m/s \tab;Titanová ruda: trocha \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: none \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Zdroj energie: žádný \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Terrain in places too uneven for wheeled bots.
cs: \tab;Terén je pro roboty na kolečkách místy nesjízdný.
