Repository: colobot/colobot-data
Catalog: colobot/levels/exercises/chapter001/level001/po/*.po
Languages: de

source: Spiders 1
de: Spinnen 1

source: Kill three spiders with a small program.
de: Töten Sie drei Spinnen mit einem kleinen Programm.

source: Spider1
de: Spinne1

source: Objective
de: Ziel

source: Write a small program to kill three spiders.
de: Schreiben Sie ein kleines Programm zur Eliminierung von 3 Spinnen.

source: Procedure
de: Das Vorgehen

source: In order to program the bot, select it.
de: Selektieren Sie den Roboter, um ihn zu programmieren.

source: The numbers 1 to 4 corresponding to the programs contained in the bot appear on the lower left-hand corner of your screen. Select the first line.
de: Die Zahlen 1 bis 4, die den Programmen entsprechen, welche der Roboter besitzt, erscheinen in der unteren linken Ecke Ihres Bildschirms. Klicken Sie auf die erste Zeile.

source: Click the button with the braces <button 22/>, and you will arrive in an editor where you can write the program.
de: Klicken Sie auf die Schaltfläche mit den geschweiften Klammern <button 22/>, um zum Editor zu gelangen, wo Sie dann das Programm schreiben können.

source: While you are writing the program, the key <format key><key help/></format> will display the text you are reading right now. When you have finished writing the program, click the "OK" button.
de: Während Sie programmieren, können Sie sich mit der Taste <format key><key help/></format> den Text ansehen, den Sie gerade lesen. Haben Sie das Programm fertiggestellt, klicken Sie auf die Schaltfläche "OK".

source: In order to execute the program, click the arrow button <button 21/>.
de: Um das Programm auszuführen, klicken Sie auf die Schaltfläche <button 21/>.

source: Program
de: Programm

source: You must tell the bot exactly step by step what it must do in order to kill the three spiders. The bot understands only precise instructions, which it will execute one after another.
de: Sie müssen dem Roboter exakt und Schritt für Schritt mitteilen, was er tun muss, um die drei Spinnen zu töten. Der Roboter versteht nur klare und korrekt formulierte Anweisungen, welche er nacheinander ausführt.

source: When you click the braces button <button 22/> in order to write the program, a part of the program will already be there:
de: Nachdem Sie auf die Schaltfläche <button 22/> geklickt haben, ist ein Teil des Programms schon vorhanden:

source: extern void object::Spider1( ) { <n/>write your program here ...<c/> }
de: extern void object::Spinne1( ) { <n/>Geben Sie Ihr Programm hier ein ...<c/> }

source: Everything that is already written when you arrive in the editor must not be altered. Just introduce the necessary instructions at the cursor.
de: Alles das, was schon geschrieben steht, wenn Sie den Editor öffnen, dürfen Sie nicht verändern. Fügen Sie notwendige Anweisungen an der Cursorposition ein.

source: You will need the following instructions:
de: Folgende Anweisungen werden Sie benötigen:

source: <n/>Puts the cannon straight.
de: <n/>Geradeaus zielen.

source: <n/>Executes a rotation of a certain angle, given in brackets in degrees. For example <c/>turn(90);<n/> will turn the bot 90 degrees to the left, i.e. a quarter turn to the left. <c/>turn(-90);<n/> will turn the bot 90 degrees to the right (quarter turn right). Positive values turn left, negative values turn right. <c/>turn(180);<n/> will make the bot face in the opposite direction.
de: <n/>Führt eine Drehung um einen bestimmten Winkel aus, der in Klammern und in Grad angegeben wird. <c/>turn(90);<n/> bewirkt zum Beispiel eine Drehung um 90 Grad nach links. Das entspricht einer Vierteldrehung. <c/>turn(-90);<n/> bewirkt eine Drehung um 90 Grad nach rechts. Positive Werte drehen nach links, negative nach rechts. <c/>turn(180);<n/> lässt den Roboter wenden.

source: <n/>Shoots the cannon. The number in brackets indicates the duration of the burst. In most cases, shoot a burst of 1 second.
de: <n/>Feuert die Kanone ab. Die Zahl in Klammern gibt die Dauer des Schusses in Sekunden an. In den meisten Fällen ist 1 Sekunde die richtige Wahl.

source: Let us see the beginning of the program:
de: Sehen wir uns den Anfang des Programmes an:

source: put the cannon straight with <c/>aim(0);<n/>
de: Zielen Sie geradeaus mittels <c/>aim(0);<n/>

source: shoot the spider straight ahead with <c/>fire(1);<n/>
de: Erschießen Sie die Spinne vor dem Roboter mittels <c/>fire(1);<n/>

source: turn 90 degrees left with <code>turn(90)</code>
de: Drehen Sie den Roboter mittels <code>turn(90)</code> um 90 Grad nach links

source: shoot with <c/>fire(1);<n/>
de: Feuern mittels <c/>fire(1);<n/>

source: etc.
de: usw.

source: Here is the program that does all this :
de: Hier ist ein Programm, das all diese Schritte durchführt:

source: extern void object::Spider1( ) { aim(0); fire(1); turn(90); fire(1); }
de: extern void object::Spinne1( ) { aim(0); fire(1); turn(90); fire(1); }

source: It is up to you now to write the rest of the program!
de: Es ist nun Ihre Aufgabe, den Rest des Programms zu schreiben!

source: If you have got a problem, you can always look at the solution: select the <code>Solution</code> program on the lower left-hand corner of the screen, and click the braces button <button 22/>. You can even execute the solution program with the arrow button <button 21/>.
de: Wenn Sie ein Problem haben und nicht weiterkommen, können Sie jederzeit einen Blick in die Lösung werfen: Wählen Sie das Programm <code>Lösung</code> in der linken unteren Ecke des Bildschirms aus und klicken Sie auf die Schaltfläche <button 22/>. Sie können das Lösungsprogramm auch durch Betätigen der Pfeilschaltfläche <button 21/> ausführen.

source: Remarks
de: Hinweise

source: Be careful to write the instructions precisely, respecting lower and upper case letters.
de: Achten Sie darauf, die Anweisungen korrekt zu schreiben. Nehmen Sie auf Groß- und Kleinschreibung Rücksicht.

source: Always write one instruction per line, finishing each line with a semicolon.
de: Schreiben Sie immer nur eine Anweisung pro Zeile und schließen Sie jede Zeile mit einem Strichpunkt ab.

source: In case your program does not do exactly what you wanted, you can put the bot back at the starting point with the <button 59/> button. You can also start over again from the beginning (hit the "Esc" key, then click "Restart"). The program you have written will not be lost.
de: Tut Ihr Programm nicht das, was Sie erreichen wollten, können Sie den Roboter an seine Startposition zurückbefördern, indem Sie die Schaltfläche <button 59/> betätigen. Sie können auch ganz von vorn beginnen ("Esc" drücken, dann auf "Neu Starten" klicken). Das Programm, das Sie geschrieben haben geht dabei nicht verloren.

source: <format key><key help/></format> allows you to review these instructions at all times.
de: Mit <format key><key help/></format> können Sie diese Anweisungen jederzeit einsehen.
