Repository: colobot/colobot-data
Catalog: levels/missions/chapter004/level002/po/*.po
Languages: cs

source: Subterranean strategy
cs: Podzemní strategie

source: Use the planet's resources to combat the virus-spreading worms.
cs: Využijte zdroje planety k boji proti červům přenášejícím viry.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: The radar seems to be perfectly suited to the detection of worms. Keep in mind though that they only appear when they are on the surface.
cs: Radar se zdá být pro hledání červů zvláště vhodný. Pamatujte ale, že je lze zaměřit pouze když vylezou na povrch.

source: We relayed a transmission to your <a object|factory>bot factory</a>. It concerns a bot designed to detect raw materials in the subsoil: energy sources, ore. We call it a <a object|botsr>sniffer</a> for short. Preliminary analysis leads us to believe that the presence of titanium ore on Crystalium is closely linked to the growth of large blue crystals. If this is indeed the case, this information should allow you to save some precious time. A <a object|derrick>derrick</a> is of course required for the extraction.
cs: Vaší <a object|factory>továrně na roboty</a> jsme poslali plány robota vytvořeného pro hledání podzemních zdrojů: rudy nebo zdrojů energie. Zkráceně mu říkáme <a object|botsr>detektor</a>. Předběžná analýza naznačuje, že přítomnost titanové rudy na Krystaliu úzce souvisí s růstem velkých modrých krystalů. Pokud je to skutečně tak, tato informace by Vám měla ušetřit trochu cenného času. Pro těžbu je samozřejmě potřeba <a object|derrick>vrtná věž</a>.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Crystalium.
cs: Aktuálně na stacionární oběžné dráze Krystalia.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 3.2C \tab;Atmosphere: nitrogen \tab;Wind: 0.0 mps \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Teplota: 3,2 °C \tab;Atmosféra: dusík \tab;Vítr: 0,0 m/s \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: isolated (close to the spaceship) \tab;Titanium ore: scattered \tab;Uranium ore: none
cs: \tab;Zdroj energie: lokální (poblíž rakety) \tab;Titanová ruda: roztroušená \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: worms \tab; - Danger: no
cs: \tab;Nalezeno: červi \tab; - Nebezpečí: žádné

source: Walkthrough
cs: Návod

source: Build a <a object|factory>bot factory</a>.
cs: Postavte <a object|factory>továrnu na roboty</a>.

source: Produce a <a object|botsj>winged sniffer</a>.
cs: Vyrobte <a object|botsj>létající detektor</a>.

source: Sniff the ground near the large crystals until you get a <a object|stonspot>red cross</a>.
cs: Hledejte podzemní zdroje kolem velkých krystalů, dokud robot nepoloží <a object|stonspot>červený křížek</a>.

source: Build a <a object|derrick>derrick</a> near the red cross.
cs: Poblíž červeného křížku postavte <a object|derrick>vrtnou věž</a>.

source: Build a <a object|convert>converter</a>.
cs: Postavte <a object|convert>konvertor</a>.

source: The pairing of a derrick and a converter allows for an unlimited supply of <a object|titan>titanium</a>. In order to leave this task to a bot, execute the program <code>CollectTitanium2</code>.
cs: Kombinace vrtné věže a konvertoru představuje nevyčerpatelný zdroj <a object|titan>titanu</a>. Spusťte program <code>CollectTitanium2</code>, aby se o zpracování rudy postaral robot.

source: Sniff the area at the foot of the spaceship. A <a object|enerspot>green cross</a> means you can build a <a object|station>power station</a> on the spot.
cs: Prozkoumejte podzemní zdroje kolem rakety. <a object|enerspot>Zelený křížek</a> znamená, že na daném místě můžete postavit <a object|station>nabíječku</a>.

source: Build a <a object|radar>radar</a>.
cs: Postavte <a object|radar>radar</a>.

source: Produce a <a object|botfj>winged shooter</a>.
cs: Vyrobte <a object|botfj>létající kanón</a>.

source: Eliminate all worms.
cs: Zlikvidujte všechny červy.

source: 10) Go back to your ship and take off.
cs: 10) Vraťte se do rakety a odleťte.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
