Repository: colobot/colobot-data
Catalog: colobot/levels/battles/chapter001/level001/po/*.po
Languages: ru

source: Code battle - vs aliens
ru: Битвы программистов - против пришельцев

source: A map for begginers! Research all needed technologies and build your infrastructure to kill all the aliens on the opposite side of the river - using programming only!
ru: Карта для новичков! Изучи все необходимые технологии и построй свою инфраструктуру для того, чтобы убить пришельцев на противоположной стране реки - используя только программирование!

source: Code Battle (vs Aliens)
ru: Битвы программистов (против Пришельцев)

source: This is a training code battle level, which purpose is to familiarize you with this <a battles>game mode</a>.
ru: Это тренировочная битва программистов, суть которой объяснить вам этот <a battles>режим игры</a>

source: Brief introduction
ru: Краткое введение

source: Code battle is a completely new game mode featured in Colobot: Gold Edition. There are two or more teams and the one that survives the longest is the winner. As the name suggest, you can only use programming in this game mode.
ru: Битвы программистов совершенно новый игровый режим в Colobot: Gold Edition. Есть две или больше команд и та что выживет будет победителем. Как подсказывает название, в этом игровом режиме ты можешь только программировать.

source: It is recommended to read <a %lvl%/help/help.%lng% notes>the notes section</a> below.
ru: Рекомендуется прочитать <a %lvl%/help/help.%lng% notes>раздел заметок</a> сниху

source: Your objective
ru: Твоя цель

source: Kill all the aliens located on the other side of the river.
ru: Убей всех инопланетян, находящихся на другой стороне реки.

source: Notes\m notes;
ru: Заметки\m заметки;

source: The <a object/ant>aliens</a> will not attack you, unless you come too close to them.
ru: <a object/ant>Инопланетяне</a> не будут атаковать тебя, пока ты не подберёшься к ним слишком близко.

source: <a cbot>The CBOT documentation</a> might come in handy.
ru: <a cbot>Документация CBOT</a> может оказаться полезной.

source: There is <a object/enerspot>an underground power source</a> only under the beginning base areas.
ru: Здесь есть <a object/enerspot>подземный источник энергии</a> только под начальной базой.

source: If you have not played Colobot before, it is recommended to read about <a battles production>the basics of production line</a>.
ru: Если вы не играли в Colobot до этого, рекомендуется прочитать <a battles production>основы линии производства</a>

source: The pre-built <a object|derrick>Derrick</a> and <a |object\radar>RadarStation</a> are indestructible.
ru: Построенные <a object|derrick>Буровая вышка</a> и <a |object\radar>радар</a> являются неразрушаемыми.
