Repository: colobot/colobot-data
Catalog: levels/exercises/chapter001/level005/po/*.po
Languages: pt_br

source: Power Cell 2
pt_br: Pile 2

source: Power all the winged shooters.
pt_br: Equiper les robots shooters de piles

source: Spider2
pt_br: Pile2

source: Objective
pt_br: Objectif

source: Power the <a object|botfj>winged shooters</a> with <a object|power>power cells</a>, so that they can kill the ants in the ant nest located in a hole north of your position.
pt_br: Equipez les <a object|botfj>robots shooter</a> de <a object|power>piles</a>, pour que ceux-ci puissent assainir le nid de <a object|ant>fourmis</a> qui se trouve dans un cratère au nord de votre position.

source: Program
pt_br: Programme

source: The <a object|botgr>wheeled grabber</a> must go to a <a object|power>power cell</a>, grab it, go to a <a object|botfj>winged shooter</a>, and drop the cell. This task is very similar to the task performed in the previous exercise. Here is this program again:
pt_br: Le robot déménageur doit aller vers une pile, prendre celle-ci, aller vers un robot, et poser la pile. Voici un programme d'un exercice précédent qui accomplit une tâche semblable:

source: extern void object::Titanium2() { object item; item = radar(TitaniumOre); goto(item.position); grab(); item = radar(Converter); goto(item.position); drop(); }
pt_br: extern void object::Titanium2() { object chose; chose = radar(TitaniumOre); goto(chose.position); grab(); chose = radar(Converter); goto(chose.position); drop(); }

source: Instead of looking for titanium ore (<code>TitaniumOre</code>), look for a power cell (<code>PowerCell</code>). Instead of going to a converter (<code>Converter</code>), go to a winged shooter (<code>WingedShooter</code>). As soon as the winged shooter has got a new power cell, it will get down to work.
pt_br: Vous pouvez reprendre ce programme avec couper-coller, et apporter les changements nécessaires. Au lieu de chercher un minerai de titanium (<code>TitaniumOre</code>), cherchez une pile (<code><a object|power>PowerCell</a></code>). Au lieu d'aller ensuite vers un convertisseur (<code>Converter</code>), allez vers un robot shooter (<code><a object|botfj>WingedShooter</a></code>). Le shooter fera ensuite son travail.

source: If you want to know more about the "names" of the different objects in the programming language, please refer to the <a cbot|category>text about categories</a>.
pt_br: Pour savoir comment s'appellent les différents objets dans le langage de programmation, reportez-vous au <a cbot|category>texte décrivant les catégories</a>.

source: Further improvement: loops
pt_br: Perfectionnement: les boucles

source: Once the program explained above works properly, you can improve it in order to repeat the task over and over again. Like this you will not have to execute the program several times in order to power several bots.
pt_br: Une fois que le programme expliqué ci-dessus fonctionne, vous pouvez l'améliorer de manière à ce qu'il répète les actions nécessaires tout seul. Vous n'aurez plus à exécuter le programme plusieurs fois pour qu'il équipe plusieurs robots.

source: All programs written until now execute all instructions only once, one after another, from the beginning to the end of the program. You can also tell the bot to repeat some instructions: just write <code>while (true)</code>, an open brace, the instructions to be repeated, and a closing brace. Repeating some instructions several times in this way is called a loop. Here is an example of a program that repeats over and over the instructions that look for a power cell, grab it, and drop it on a winged shooter:
pt_br: Ajoutez simplement une instruction <code><a cbot|while>while</a>(true)</code> au début du programme, avec toutes les instructions à répéter entre les accolades <code>{}</code>:

source: while (true) { item = radar(PowerCell); goto(item.position); grab(); item = radar(WingedShooter); goto(item.position); drop(); }
pt_br: while (true) { chose = radar(PowerCell); goto(chose.position); grab(); chose = radar(WingedShooter); goto(chose.position); drop(); }

source: Of course the variable declaration <c/>object item;<n/> must not be inside the loop, but just before: declare a variable only once.
pt_br: N'oubliez pas de déclararer la variable <c/>object chose;<n/> avant de l'utiliser la première fois.

source: Remark
pt_br: Remarque

source: A bot can execute a program perfectly well on his own. Meantime you can for example select the astronaut and take a look at what is happening at the nest, the show is worth it. But be careful not to get shot by your own bots...
pt_br: Un robot peut exécuter un programme tout seul: pendant ce temps, vous pouvez sélectionner le <a object|human>cosmonaute</a> et aller observer ce qui se passe vers le nid, en faisant cependant attention de ne pas vous mettre dans la ligne de tir. Les touches <format key><key gup/></format> et <format key><key gdown/></format> permettent de voler. Cliquez <a command>ici</a> pour voir le détail des commandes de déplacement.

source: See also
pt_br: Voir aussi

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
pt_br: <a tlaby2>Exercice précédent</a> et <a cbot>programmation</a>.
