Repository: colobot/colobot-data
Catalog: levels/missions/chapter003/level003/po/*.po
Languages: cs

source: On the Offensive
cs: Do útoku

source: Develop an offensive weapons system and confront the giant ants.
cs: Vyrobte útočný zbraňový systém a postavte se obřím mravencům.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: The satellite has detected an energy source, on a spot marked by the previous expedition with a blue flag (blue cross on the mini-map).
cs: Satelit objevil zdroj energie na místě, které předchozí výprava označila modrou vlajkou (modrý křížek na minimapě).

source: Do not forget to take a look at the satellite report <button 186/> before you venture any further in a mission; we suspect that you have not always done this.
cs: Nezapomeňte se podívat na informace ze satelitu <button 186/>, než se pustíte do plnění mise. Máme obavu, že toto zanedbáváte.

source: We have improved the recharge program. Please refer to the page <button 53/>.
cs: Vylepšili jsme nabíjecí program. Podrobnosti najdete v seznamu programů <button 53/>.

source: A note of warning: bots cannot be submerged. If in doubt, test the water yourself if you plan to radio-control a non-winged bot across - water shouldn't be deeper than knee-level.
cs: Upozornění: Roboti se nemohou potápět. Pokud potřebujete zjistit, jestli pozemní robot dokáže bezpečně přebrodit vodu, vyzkoušejte hloubku sami - voda Vám nesmí sahat výše než po kolena.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Tropica.
cs: Aktuálně na stacionární oběžné dráze Tropiky.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 29.6C \tab;Atmosphere: helium, oxygen \tab;Wind: 1.5 mps \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Teplota: 29,6 °C \tab;Atmosféra: helium, kyslík \tab;Vítr: 1,5 m/s \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: isolated (blue flag) \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Zdroj energie: lokální (modrá vlajka) \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: giant ants \tab; - Danger: not immediate \tab;Detected: reusable derelicts
cs: \tab;Nalezeno: obří mravenci \tab; - Nebezpečí: není bezprostřední \tab;Nalezeno: recyklovatelné vraky

source: Walkthrough
cs: Návod

source: There is a <a object|titan>titanium cube</a> west of your present location, near the blue flag/blue cross on your mini map. You don't need to move the cube, just build a <a object|station>power station</a> right there on the spot.
cs: Na západ od Vaší startovní pozice je <a object|titan>kostka titanu</a>, poblíž modré vlajky/modrého křížku na minimapě. Nemusíte ji nikam nosit, prostě přímo na místě postavte <a object|station>nabíječku</a>.

source: With the titanium cubes on the spaceship, build a <a object|research>research center</a> and execute the <shooter cannon research program> <button 67/>.
cs: Z kostek titanu na palubě rakety postavte <a object|research>výzkumnou stanici</a> a spusťte výzkum kanónů <button 67/>.

source: Build a <a object|factory>bot factory</a> and a <a object|botfj>winged shooter</a>. If this bot is destroyed by enemy fire, you will find some additional <a object|titan>titanium cubes</a> in a small foggy valley northwest of the spaceship. You can bring them back with the <a object|botgj>winged grabber</a><n/>.
cs: Postavte <a object|factory>továrnu na roboty</a> a vyrobte <a object|botfj>létající kanón</a>. Kdyby Vám nepřátelé první kanón zničili, v malém mlžném údolí na severozápad od rakety najdete další <a object|titan>kostky titanu</a>. <a object|botgj>Létající rameno</a> je může posbírat a přivézt k raketě<n/>.

source: Build a <a object|radar>radar station</a> in order to see the location of the ants on the mini-map, and let the hunt begin. Be careful not to run out of energy and not to overheat the reactor of a bot while over water. If a bot falls into deep water, it explodes.
cs: Postavte <a object|radar>radar</a>, abyste polohu mravenců viděli na minimapě, a vydejte se na lov. Dávejte pozor, aby robotu nedošla energie nebo se nepřehřál tryskový motor nad vodou. Když robot spadne do hluboké vody, vybuchne.

source: Once you have killed all the ants, get on board and take off.
cs: Až zlikvidujete všechny mravence, nastupte do rakety a odleťte.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
