Repository: colobot/colobot-data
Catalog: levels/missions/chapter003/level002/po/*.po
Languages: cs

source: Amnesia
cs: Amnézie

source: Find your spaceship in the Tropica maze.
cs: Najděte v bludišti Tropiky svou raketu.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: It is our hope that this message will reach you.
cs: Doufáme, že tuto zprávu dostanete.

source: A transmission from the observation satellite a few hours ago informed us that you seemed to be wandering in a frighteningly uncoordinated manner. Your SatCom has ceased broadcasting. Your reactor seems to have suffered some sort of damage and your helmet was spotted at the bottom of a lake. If this is indeed the case, do not try to retrieve it, do not go into the water! Water on Tropica is highly toxic. You would not survive it.
cs: Zpráva z průzkumného satelitu nás před několika hodinami upozornila, že se znepokojivě motáte sem a tam. Váš SatKom přestal vysílat. Tryskový motor na Vašem skafandru se zdá být nějak poškozený a Vaše helma podle všeho leží na dně jezera. Pokud je to opravdu tak, nesnažte se ji vylovit, nechoďte do vody! Voda na Tropice je prudce jedovatá. Okamžitě by Vás zabila.

source: There is nothing we can really do to guide you but don't forget that you're following in the footsteps of a previous expedition. If what happened to you is what happened to them, chances are they may have left some clues along the way back to their own spaceship which landed in roughly the same area as yours. Use those clues.
cs: Nemůžeme Vám nijak pomoct s hledáním cesty, ale nezapomeňte, že jdete ve šlépějích předchozí výpravy. Pokud se jim stalo totéž, co Vám, možná za sebou nechali nějaké stopy během návratu k vlastní raketě, která přistála zhruba ve stejné oblasti jako Vy. Využijte tyto stopy.

source: You may also want to consider planting flags. They indicate the direction of the wind so you can use them to orient yourself.
cs: Také byste na vhodných místech mohli rozmístit vlajky. Vlají vždy po větru, takže se podle nich můžete orientovat.

source: This is all we can say for now... Good Luck...
cs: To je vše, co prozatím víme... Hodně štěstí...

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a>
cs: <a command>Ovládání</a>

source: Walkthrough
cs: Návod

source: Here is a breakdown of the steps to follow to get back to the spaceship.
cs: Zde je podrobný postup, jak se dostat zpět k raketě.

source: Go round the lake, and head towards the green fluorescent globe. This globe is generated by a gravi-plant that will make flight impossible inside the globe.
cs: Běžte kolem jezera směrem k průhledné zelené kouli. Tuto kouli generuje rostlina provizorně nazvaná přízemnice. Uvnitř koule nemůžete létat.

source: Follow the left flank of the valley, passing a pond on your right, and climb the small slope. On top you will be facing some giant ants: run as fast as you can towards another gravi-plant a little further on your right, your wounds will have time to heal later.
cs: Pokračujte podél levé strany údolí, obejděte tůni po levém břehu a vyšplhejte po nízkém svahu. Nahoře narazíte na několik obřích mravenců: Co nejrychleji prchejte k další přízemnici kousek dál napravo, zranění se Vám za chvíli zahojí.

source: Use your reactor to fly past the lake before the gravi-plant on your right.
cs: Přeleťte pomocí tryskového motoru přes jezero před přízemnicí napravo.

source: When you leave the gravi-plant, keep on the left-hand side of the lake, and follow the shore until you reach a peninsula adorned with fern-like plants.
cs: Až projdete skrz silové pole přízemnice, pokračuje podél levého břehu, až dojdete na poloostrov porostlý kapradinami.

source: Do some island-hopping across the larger lake. Aim for the trees in order to avoid falling into the water on the other side of the island. The last island is 50 cm under water but you can still land on it without having your head submerged.
cs: Velké jezero přehopsejte po malých ostrůvcích. Snažte se trefit do stromů, abyste nepřelétli přes ostrůvek až do vody. Poslední ostrůvek je 50 cm pod hladinou, ale pořád na něm budete mít hlavu nad vodou.

source: The path continues to the left. A giant ant is waiting for you there, but it will not do you much harm.
cs: Cesta pokračuje doleva. Čeká tam na Vás obří mravenec, ale moc Vám neublíží.

source: Give your reactor enough time to cool down, then fly across the small lake. Try to land as high on the right as you can, this is the best way not to fall into the second lake.
cs: Nechte tryskový motor vychladnout a přeleťte malé jezírko. Snažte se přistát co nejvýše vpravo, ať nespadnete do druhého jezera.

source: Cross the second lake, get aboard the spaceship, and take off.
cs: Přeleťte druhé jezero, nastupte do rakety a odleťte.
