Repository: colobot/colobot-data
Catalog: levels/exercises/chapter003/level008/po/*.po
Languages: ru

source: The gold digger
ru: Золото копатель

source: Instruct your bot to search a zone for subsoil resources.
ru: Прикажите своему боту исследовать зону на месторождения.

source: Exercise
ru: Упражнение

source: Search the whole zone inside the barriers with the <a object|botsr>sniffer bot</a> for adequate locations for a derrick. When the bot sounds the subsoil and discovers an adequate location for a derrick, it will mark it with a red cross.
ru: Исследуйте зону внутри барьеров, используя <a object|botsr>Бот Разведчик</a> для подходящего места под Вышку. Когда бот сканирует землю и находит подходящее место под Вышку, он помечает его Крестом Красным.

source: Description
ru: Описание

source: The zone inside the barriers is a square of 25 meters. The most efficient way is to check every 5 meters.
ru: Зона внутри барьеров составляет 25 квадратных метров. Самый эффективный способ - проверить каждые 5 метров.

source: One way to achieve this is to fit two <code><a cbot|for>for</a></code> loops one into another:
ru: Один из способов достичь этого - вложить два цикла <code><a cbot|for>for</a></code> один в другой:

source: for ( int y=0 ; y<6 ; y=y+1 ) { for ( int x=0 ; x<5 ; x=x+1 ) { <n/>sound the subsoil<code> </code>move 5m forward<code> } </code>sound the subsoil<code> </code>quarter turn left<code> </code>move 5m forward<code> </code>quarter turn left<c/> }
ru: for ( int y=0 ; y<6 ; y=y+1 ) { for ( int x=0 ; x<5 ; x=x+1 ) { <n/>сканировать землю<code> </code>перейти на 5 метров вперёд<code> } </code>сканировать землю<code> </code>четверть оборота влево<code> </code>перейти на 5 метров вперёд<code> </code>четверть оборота вправо<c/> }

source: This program works well only at the beginning. After the first line, the bot turns correctly left and sounds the second line. But after the second line, it must turn right! You will have noticed that if <code>y</code> is even, the bot must turn left, and if <code>y</code> is odd, the bot must turn right. The <a cbot|expr>expression</a> <code>y%2</code> returns the rest of the division of <code>y</code> by <code>2</code>. For example, if <code>y=3</code>, the expression returns <code>1</code>. The test <code><a cbot|if>if</a> { }</code> can be followed by a <code>else { }</code>. If the test is true, the first <a cbot|bloc>block</a> <code>{ }</code> will be executed. Otherwise, the second block <code>{ }</code> will be executed.
ru: Эта программа хорошо работает только в начале. После первой линии бот поворачивает точно налево и сканирует второю линию. Но после второй линии он должен свернуть вправо! Вы заметите, что если <code>y</code> чётное, бот должен повернуть налево, а если <code>y</code> нечётное, бот должен повернуть направо. <a cbot|expr>Выражение</a> <code>y%2</code> возвращает остаток от деления <code>y</code> на <code>2</code>. например, если <code>y=3</code>, выражение возвращает <code>1</code>. Проверьте <code><a cbot|if>if</a> { }</code> может следовать за <code>else { }</code>. Если проверка истинная, будет выполнен первый <a cbot|bloc>блок</a> <code>{ }</code>. Иначе будет выполнен второй блок <code>{ }</code>.

source: if ( y%2 == 0 ) { y <n/>is even<code> } else { y </code>is uneven<c/> }
ru: if ( y%2 == 0 ) { y <n/>четное<code> } else { y </code>нечетное<c/> }

source: It is up to you to finish the program.
ru: Теперь Вы должны сами закончить эту программу.

source: Remark
ru: Комментарий

source: Use the instruction <code><a cbot|sniff>sniff</a>( )</code> to sound the subsoil, and <code><a cbot|move>move</a>( )</code> and <code><a cbot|turn>turn</a>( )</code> to move the bot.
ru: Используйте инструкцию <code><a cbot|sniff>sniff</a>( )</code> чтобы сканировать землю, и <code><a cbot|move>move</a>( )</code> и <code><a cbot|turn>turn</a>( )</code> чтобы передвинуть бот.

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.
