Repository: colobot/colobot-data
Catalog: help/generic/po/*.po
Languages: ru

source: Constants like <a cbot|category>categories</a> are displayed like that: <format const>constant</format>.
ru: Константы такие как <a cbot|category>категории</a> отображаются следующим образом: <format const>константа</format>.

source: <a cheats>o</a> |c;<format token>Instructions</format><n/> In the program editor, an instruction in the CBOT language is always displayed like that: <format token>instruction</format>. If an instruction is not highlighted, this means that it has been misspelled. Instruction names are always written in lower case.
ru: <a cheats>o</a> |c;<format token>Инструкции</format><n/> В редакторе программ, инструкция на языке CBOT всегда отображается как: <format token>инструкция</format>. Если инструкция не подсвечена, это означает, что она написана с ошибкой. Название инструкции всегда пишется в нижнем регистре.

source: Cheats
ru: Ытич

source: Great, you have found this secret page. We hope you will use informations contained here only for other than cheating purposes. Like testing the game or recording a cool video about Colobot.
ru: Прекрасно, вы нашли эту секретную страницу. Мы надеемся вы будет использовать информацию содержащуюся здесь только в других целях, а не для жульничества. Например тестирование игры или запись классного/отстойного видео о Colobot.

source: Console
ru: Консоль

source: You can open the console by pressing the <key/><code>~</code><norm/> button on your keyboard. Press <key/><code>ENTER</code><norm/> to hide it or pass one of the commands below.
ru: Вы можете открыть консоль нажатием кнопки <key/><code>~</code><norm/> на вашей клавиатуре. Нажмите <key/><code>ENTER</code><norm/> чтобы скрыть её или чтобы выполнить одну из команд приведенных ниже.

source: Missions
ru: Миссии

source: Gameplay
ru: Игровой процесс

source: Debug
ru: Отладка

source: Aesthetic
ru: Эстетика

source: <code><a cbot|produce>produce</a> </code>Immediately creates an object
ru: <code><a cbot|produce>produce</a> </code>Немедленно создать объект

source: <code>winmission </code>Immediately win the current mission
ru: <code>winmission </code>Немедленно выиграть текущую миссию

source: <code>lostmission </code>Immediately lose the current mission
ru: <code>lostmission </code>Немедленно проиграть текущую миссию

source: <code>allresearch </code>All researches are done
ru: <code>allresearch </code>Все исследования доступны

source: <code>allbuildings </code>All buildings are enabled
ru: <code>allbuildings </code>Все здания доступны

source: <code>fullenergy </code>Restore energy in the currently selected bot
ru: <code>fullenergy </code>Восстановить энергию в текущем выбранном боте

source: <code>fullshield </code>Restore shield in the currently selected object
ru: <code>fullshield </code>Восстановить щит в текущем выбранном объекте

source: <code>fullrange </code>Flying reactor is cold
ru: <code>fullrange </code>Реактивный двигатель охладить

source: <code>fly </code>You can fly even if flying is disabled in the current mission
ru: <code>fly </code>Вы можете летать даже если полёт отключен в текущей миссии

source: <code>addfreezer </code>Flying reactor heats more slowly
ru: <code>addfreezer </code>Реактивный двигатель нагревать медленнее

source: <code>addhusky </code>You take less damage than usual
ru: <code>addhusky </code>Вы получаете меньше повреждений чем обычно

source: <code>nolimit </code>You can fly higher
ru: <code>nolimit </code>Вы можете лететь выше

source: <code>trainerpilot </code>You can drive robots which could be previously controlled only by programs
ru: <code>trainerpilot </code>Вы можете управлять роботами, которыми раньше можно было управлять только программно

source: <code>photo1 </code>Free camera, you can change angle with <key/><code>+</code><norm/> and <key/><code>-</code><norm/> keys, type again to set it off
ru: <code>photo1 </code>Свободная камера, вы можете менять угол клавишами <key/><code>+</code><norm/> и <key/><code>-</code><norm/>, повторить для отключения

source: <code>photo2 </code>Same as <code>photo1</code>, except it hides interface, type again to set it off
ru: <code>photo2 </code>Также как <code>photo1</code>, дополнительно скрывает интерфейс, повторить для отключения

source: <code>delete </code>Damages the object, <code>1</code>: object's ID, <code>2</code>: magnifyDamage multiplier, without <code>2</code> the object explodes
ru: <code>delete </code>Разрушить объект, <code>1</code>: object's ID, <code>2</code>: magnifyDamage multiplier, без <code>2</code> объект взрывается

source: <code>setbuild </code>Sets buildings bitmask, <code>1</code>: new bitmask
ru: <code>setbuild </code>Установить битовую маску Зданий, <code>1</code>: новая битовая маска

source: <code>setresearchenable </code>Sets researches bitmask, <code>1</code>: new bitmask
ru: <code>setresearchenable </code>Установить битовую маску Исследований, <code>1</code>: новая битовая маска

source: <code>setresearchdone </code>Sets done researches bitmask, <code>1</code>: new bitmask
ru: <code>setresearchdone </code>Предустановленная битовая маска Исследований, <code>1</code>: новая битовая маска

source: <code>getbuild </code>Returns buildings bitmask
ru: <code>getbuild </code>Вернуть битовую маску Зданий

source: <code>getresearchenable </code>Returns researches bitmask
ru: <code>getresearchenable </code>Вернуть битовую маску Исследований

source: <code>getresearchdone </code>Returns done researches bitmask
ru: <code>getresearchdone </code>Вернуть предустановленную битовую маску Исследований

source: <code>playmusic </code>Plays music, <code>1</code>: file name, <code>2</code>: repeat
ru: <code>playmusic </code>Проигрывать музыку, <code>1</code>: название файла, <code>2</code>: повторять

source: <code>stopmusic </code>Stops music
ru: <code>stopmusic </code>Остановить музыку

source: <code>allmission </code>All missions are unlocked, works also in main menu
ru: <code>allmission </code>Все миссии доступны, работает также в главном меню

source: <code>showsoluce </code>All solutions are unlocked, works also in main menu
ru: <code>showsoluce </code>Все описания доступны, работает также в главном меню

source: <code>selectinsect </code>You can select and control aliens, works also in main menu, type again to disable
ru: <code>selectinsect </code>Вы можете выбрать и управлять пришельцами, работает также в главном меню, повторить для отключения

source: <code>invradar </code>Mini-map works like you would have built a <a object|radar>radar</a>, works also in main menu, type again to disable
ru: <code>invradar </code>Мини-карта работает если бы у вас был построен <a object|radar>Радар</a>, работает также в главном меню, повторить для отключения

source: <code>noclip </code>The currently selected object can pass through objects
ru: <code>noclip </code>Текущий выбранный объект может проходить через объекты

source: <code>clip </code>Disable <code>noclip</code> on the currently selected object
ru: <code>clip </code>Отключить <code>noclip</code> на текущем выбранном объекте

source: <code>speed </code>Set the speed of the game to the given number, for example <code>speed 2</code> - two times faster, <code>speed 0.5</code> - two times slower, works also in main menu
ru: <code>speed </code>Установить скорость игры на заданное число, например <code>speed 2</code> - в два раза быстрее, <code>speed 0.5</code> - в два раза медленнее, работает также в главном меню

source: These commands work also in main menu. Type them again to set them off.
ru: Эти команды также работают в главном меню. Повторите их для отключения.

source: <code>showstat </code>Show debug statistics on the screen, <format key>F12</format> keyboard key has the same effect
ru: <code>showstat </code>Отобразить отладочную информацию на экране, <format key>F12</format> клавиша клавиатуры имеет такой же эффект

source: <code>debugmode </code>Enable debug mode (useful for the game developers): the verbose debugging of events and other things; make sure you run the game with <code>-loglevel trace</code> to see the effect; see also <code>-debug</code> commandline parameter
ru: <code>debugmode </code>Включить режим отладки (полезно для разработчиков игр): подробная отладка событий и прочее; убедитесь, что вы запускаете игру с <code>-loglevel trace</code>, чтобы увидеть эффект; смотрите также <code>-debug</code> консольный параметр

source: There are hidden commands in CBOT that are not even highlighted in the editor. They are considered cheating, so do not use them for "legal" programs. It should be fine to use them for level creation though if there is no other way. Numbers mean order of parameters.
ru: В CBOT есть скрытые команды, которые не подсвечиваются в редакторе. Они считаются жульничеством, поэтому не используйте их для "легальных" программ. Их можно использовать при создании уровней, если нет другого пути. Цифры означают порядок параметров.

source: <code>ipf </code>Sets the number of instructions per frame, <code>1</code>: the number, default is <code>100</code>
ru: <code>ipf </code>Установить количество инструкций на кадр, <code>1</code>: число, по умолчанию <code>100</code>

source: Basics of production line\m production;
ru: Основы производственной линии\m производства;

source: How to control the level
ru: Как управлять уровнем

source: Starting a code battle
ru: Начать битву программ

source: Controlling the spectator's view
ru: Управление просмотром зрителей

source: After a code battle is started, the camera is put into a special mode:
ru: После того, как битва программ началась, камера будет переведена в специальный режим:

source: In order to start a code battle you need to: 1. Run all the necessary programs for your/all team(s). 2. Press the <button 21/> button above the mini-map.
ru: Чтобы начать битву программ вам необходимо: 1. Запустить все необходимые программы вашей/всей команды. 2. Нажать кнопку <button 21/> над мини-картой.

source: One can select objects as a player normally would, but one will not see their interface and the camera does not rotate when the object rotates. One can also use numerical keyboard instead of mouse in order to rotate the object-centered camera.
ru: Можно выбирать объекты, как обычно делает игрок, но их интерфейс не виден, а камера не вращается, когда объект вращается. Можно также использовать числовую клавиатуру вместо мыши для поворота камеры по центру объекта.

source: One can return to the normal view by pressing the <button 13/> button above the mini-map.
ru: Вернуться к нормальному виду можно, нажав кнопку <button 13/> над мини-картой.

source: One can also switch to the free camera view by clicking somewhere on the map. One can move around in this view by using the numerical keyboard and <format key>PageUp</format>/<format key>PageDown</format> keys.
ru: Также можно переключиться в режим свободного просмотра камеры, щелкнув где-нибудь на карте. Также можно перемещаться с помощью цифровой клавиатуры и клавиш <format key>PageUp</format>/<format key>PageDown</format>.

source: <code><a cbot|detect>detect</a> </code>Simple object detection <code><a cbot|radar>radar</a> </code>Advanced object detection <code><a cbot|radarall>radarall</a> </code>Advanced multiple objects detection <code><a cbot|search>search</a> </code>Object detection from a specific point <code><a cbot|direct>direction</a> </code>Calculates a rotation angle <code><a cbot|dist>distance</a> </code>Calculates a distance <code><a cbot|dist2d>distance2d</a> </code>Calculates a distance <code><a cbot|wait>wait</a> </code>Waits <code><a cbot|move>move</a> </code>Moves forward or backward <code><a cbot|turn>turn</a> </code>Turns <code><a cbot|goto>goto</a> </code>Goes to a given position <code><a cbot|motor>motor</a> </code>Direct motor control <code><a cbot|jet>jet</a> </code>Direct jet engine control <code><a cbot|message>message</a> </code>Displays a message <code><a cbot|retobj>retobject</a> </code>Returns an object from a function <code><a cbot|errmode>errmode</a> </code>Error treatement control <code><a cbot|abstime>abstime</a> </code>Returns the absolute time <code><a cbot|pendown>pendown</a> </code>Starts drawing <code><a cbot|penup>penup</a> </code>Stops drawing <code><a cbot|pencolor>pencolor</a> </code>Changes the pen color <code><a cbot|penwidth>penwidth</a> </code>Changes the pen width <code><a cbot|canresearch>canresearch</a> </code>Checks if a technology can be researched <code><a cbot|researched>researched</a> </code>Checks if a technology is researched
ru: <code><a cbot|detect>detect</a> </code>Обнаружить объект <code><a cbot|radar>radar</a> </code>Обнаружить объект расширено <code><a cbot|radarall>radarall</a> </code>Обнаружить множество объектов расширено <code><a cbot|search>search</a> </code>Обнаружить объект с определённой точки <code><a cbot|direct>direction</a> </code>Рассчитать угол поворота <code><a cbot|dist>distance</a> </code>Рассчитать расстояние <code><a cbot|dist2d>distance2d</a> </code>Рассчитать расстояние <code><a cbot|wait>wait</a> </code>Ждать <code><a cbot|move>move</a> </code>Двигаться вперёд или назад <code><a cbot|turn>turn</a> </code>Повернуться <code><a cbot|goto>goto</a> </code>Перейти на заданную позицию <code><a cbot|motor>motor</a> </code>Управлять двигателем напрямую <code><a cbot|jet>jet</a> </code>Управлять реактивным двигателем напрямую <code><a cbot|message>message</a> </code>Отобразить сообщение <code><a cbot|retobj>retobject</a> </code>Вернуть объект из функции <code><a cbot|errmode>errmode</a> </code>Контролировать обработчик ошибок <code><a cbot|abstime>abstime</a> </code>Вернуть абсолютное время. <code><a cbot|pendown>pendown</a> </code>Начать рисовать/Опустить перо <code><a cbot|penup>penup</a> </code>Остановить рисовать/Поднять перо <code><a cbot|pencolor>pencolor</a> </code>Поменять цвет пера <code><a cbot|penwidth>penwidth</a> </code>Изменить ширину пера <code><a cbot|canresearch>canresearch</a> </code>Проверить, можно ли исследовать технологию <code><a cbot|researched>researched</a> </code>Проверить, исследуется ли технология

source: <code><a cbot|class>class</a> </code>Class declararion <code><a cbot|public>public</a> </code>Declares a public class member <code><a cbot|private>private</a> </code>Declares a private class member <code><a cbot|protected>protected</a> </code>Declares a protected class member <code><a cbot|static>static</a> </code>Declares a static class member <code><a cbot|synchro>synchronized</a> </code>Prevents simultaneous execution <code><a cbot|new>new</a> </code>Creates a new instance <code><a cbot|this>this</a> </code>Reference to the current instance <code><a cbot|extends>extends</a> </code>Extends a class <code><a cbot|super>super</a> </code>Grants access to the parent class
ru: <code><a cbot|class>class</a> </code>Объявить Класс <code><a cbot|public>public</a> </code>Объявить public член класса <code><a cbot|private>private</a> </code>Объявить private член класса <code><a cbot|protected>protected</a> </code>Объявить protected член класса <code><a cbot|static>static</a> </code>Объявить static член класса <code><a cbot|synchro>synchronized</a> </code>Предотвратить одновременное выполнение <code><a cbot|new>new</a> </code>Создать новый экземпляр <code><a cbot|this>this</a> </code>Ссылка на текущий экземпляр <code><a cbot|extends>extends</a> </code>Расширить класс <code><a cbot|super>super</a> </code>Предоставить доступ к родительскому классу

source: <format key><key speed_dec/></format> = slow down speed by half <format key><key speed_reset/></format> = normal speed x1 <format key><key speed_inc/></format> = increase speed twice <format key><key quicksave/></format> = quick save <format key><key quickload/></format> = quick load <format key><key quit/></format> = exits mission <button 11/>
ru: <format key><key speed_dec/></format> = снизить скорость вдвое <format key><key speed_reset/></format> = нормальная скорость x1 <format key><key speed_inc/></format> = увеличить скорость вдвое <format key><key quicksave/></format> = быстро сохранить <format key><key quickload/></format> = быстро загрузить <format key><key quit/></format> = завершить миссию <button 11/>
