Repository: colobot/colobot-data
Catalog: help/generic/po/*.po
Languages: ru

source: Programming - the CBOT language
ru: Программирование - язык CBOT

source: The CBOT language is very close in structure and syntax to C++ and Java. It has been adapted for the specific purposes of COLOBOT, and for an efficient pedagogical approach. This language is made up of instructions (see below), <a cbot|bloc>blocks</a>, <a cbot|function>functions</a>, <a cbot|class>classes</a>, <a cbot|var>variables</a>, <a cbot|array>arrays</a>, <a cbot|expr>expressions</a> and <a cbot|cond>conditions</a>.
ru: Язык CBOT очень близок к структуре и синтаксису языков C++ и Java. Он был адаптирован для специальных целей COLOBOT и для эффективного педагогического подхода. Этот язык состоит из инструкций (смотрите ниже), <a cbot|bloc>блоки</a>, <a cbot|function>функции</a>, <a cbot|class>классы</a>, <a cbot|var>переменные</a>, <a cbot|array>массивы</a>, <a cbot|expr>выражения</a> и <a cbot|cond>условия</a>.

source: <code><format type>Type</format></code>
ru: <code><format type>Тип</format></code>

source: <code><format const>Constants</format></code>
ru: <code><format const>Константы</format></code>

source: Instructions in the CBOT language:
ru: Инструкции в языке CBOT:

source: Specific instructions for bots:
ru: Специальные инструкции для ботов:

source: Instructions about topology:
ru: Инструкции о топологии:

source: Instructions specific to some bots:
ru: Специальные инструкции для некоторых ботов:

source: Specific instructions for exchange posts:
ru: Специальные инструкции по обмену сообщениями:

source: <code><a cbot|receive>receive</a> </code>Receives an information <code><a cbot|send>send</a> </code>Sends a new information <code><a cbot|testinfo>testinfo</a> </code>Tests if an information exists <code><a cbot|delinfo>deleteinfo</a> </code>Deletes an existing information
ru: <code><a cbot|receive>receive</a> </code>Получить информацию <code><a cbot|send>send</a> </code>Послать новую информацию <code><a cbot|testinfo>testinfo</a> </code>Проверить существование информации <code><a cbot|delinfo>deleteinfo</a> </code>Удалить существующую информацию

source: Specific instructions for classes:
ru: Специальные инструкции для классов:

source: Specific instructions for strings:
ru: Специальные инструкции для строк:

source: <code><a cbot|strlen>strlen</a> </code>Gets string length <code><a cbot|strleft>strleft</a> </code>Extracts left part <code><a cbot|strright>strright</a> </code>Extracts right part <code><a cbot|strmid>strmid</a> </code>Extracts center part <code><a cbot|strfind>strfind</a> </code>Finds a substring. <code><a cbot|strval>strval</a> </code>Converts string to number <code><a cbot|strupper>strupper</a> </code>Converts to upper case <code><a cbot|strlower>strlower</a> </code>Converts to lower case
ru: <code><a cbot|strlen>strlen</a> </code>Получить длину строки <code><a cbot|strleft>strleft</a> </code>Извлечь левую часть <code><a cbot|strright>strright</a> </code>Извлечь правую часть <code><a cbot|strmid>strmid</a> </code>Извлечь центральную часть <code><a cbot|strfind>strfind</a> </code>Найти подстроку. <code><a cbot|strval>strval</a> </code>Преобразовать строку в число <code><a cbot|strupper>strupper</a> </code>Преобразовать в верхний регистр <code><a cbot|strlower>strlower</a> </code>Преобразовать в нижний регистр

source: Specific instructions for files:
ru: Специальные инструкции для файлов:

source: <code><a cbot|open>open</a> </code>Opens a file <code><a cbot|close>close</a> </code>Closes a file <code><a cbot|writeln>writeln</a> </code>Writes line to a file <code><a cbot|readln>readln</a> </code>Reads line from a file <code><a cbot|eof>eof</a> </code>Tests if end of file <code><a cbot|deletef>deletefile</a> </code>Deletes a file
ru: <code><a cbot|open>open</a> </code>Открыть файл <code><a cbot|close>close</a> </code>Закрыть файл <code><a cbot|writeln>writeln</a> </code>Записать строку в файл <code><a cbot|readln>readln</a> </code>Считать строку из файла <code><a cbot|eof>eof</a> </code>Проверить достигнут ли конец файла (EOF) <code><a cbot|deletef>deletefile</a> </code>Удалить файл

source: See also
ru: Смотрите также

source: <a cbot|type>Types</a> and <a cbot|category>categories</a>.
ru: <a cbot|type>Типы</a> и <a cbot|category>категории</a>.

source: Controls
ru: Управление

source: You are advised to play with one hand on the arrow keys and the other hand on the mouse.
ru: Рекомендуется играть одной рукой на клавишах со стрелками, а другой рукой мышью.

source: Bots
ru: Боты

source: <format key><key left/></format> = turn left <format key><key right/></format> = turn right <format key><key up/></format> = move forward <format key><key down/></format> = move back These controls are unavailable when working with the <a object|bottr>practice bots</a>.
ru: <format key><key left/></format> = повернуть влево <format key><key right/></format> = повернуть вправо <format key><key up/></format> = двигаться вперёд <format key><key down/></format> = двигаться назад Это управление недоступно при работе с <a object|bottr>Ботом Учебным</a>.

source: <format key><key gup/></format> = take off and climb <button 28/> <format key><key gdown/></format> = descend and land <button 29/> These controls are of course restricted to the <a object|human>astronaut</a> as well as the various <a object|botgj>winged bots</a> and in selected missions only.
ru: <format key><key gup/></format> = взлететь и подняться <button 28/> <format key><key gdown/></format> = спуститься и приземлиться <button 29/> Это управление, доступно только для <a object|human>Космонавта</a>, а также для <a object|botgj>Бота Крылатого</a> и только в некоторых миссиях.

source: mouse forward = higher aim mouse backward = lower aim mouse right = aim right mouse left = aim left These controls are only available to the <a object|botfr>shooters</a>, the <a object|botor>orga shooters</a> and the <a object|botphaz>phazer shooter</a>.
ru: мышь вперёд = прицел поднять мышь назад = прицел опустить мышь вправо = прицел вправо мышь влево = прицел влево Это управление доступно только для <a object|botfr>Стрелка</a>, <a object|botor>Био-Стрелка</a> и <a object|botphaz>Стрелка Ферзь</a>.

source: <format key><key action/></format> = main action for a given selection (human or bot) This control will for example operate the arm of a <a object|botgr>grabber</a> or fire a <a object|botfr>shooter</a> <button 42/>.
ru: <format key><key action/></format> = основное действие для данного выбора (человек или бот) Это управление, например управляет манипулятором <a object|botgr>Погрузчика</a> или огнём <a object|botfr>Стрелка</a> <button 42/>.

source: Selections
ru: Выбор

source: <format key><key next/></format> = selects next object <format key><key human/></format> = selects astronaut <format key><key desel/></format> = previous selection <button 10/>
ru: <format key><key next/></format> = выбрать следующий объект <format key><key human/></format> = выбрать космонавта <format key><key desel/></format> = выбрать предыдущий объект <button 10/>

source: Camera
ru: Камера

source: <format key><key camera/></format> = shifts between onboard and following cameras <button 13/> <format key><key near/></format> = zoom in <format key><key away/></format> = zoom out <format key><key visit/></format> = pauses the game and shows where the latest message originated. Press again to show origin of previous message.
ru: <format key><key camera/></format> = переключить между бортовой и задней камерой <button 13/> <format key><key near/></format> = увеличить <format key><key away/></format> = уменьшить <format key><key visit/></format> = остановить игру и показать последнее сообщение. Нажать повторно, чтобы показать предыдущее сообщение.

source: Help
ru: Помощь

source: <format key><key help/></format> = mission instructions <format key><key prog/></format> = programming help
ru: <format key><key help/></format> = инструкции миссии <format key><key prog/></format> = помощь в программировании

source: Game
ru: Игра

source: All these commands can be redefined in the options/controls menu.
ru: Все эти клавиши можно переназначить в меню опции/управление.

source: Objective
ru: Задание

source: Here you can play around without any definite objective. You can do whatever you want, explore the region, build a base camp and several bots, run various research programs, kill the insects if you find some, etc.
ru: Здесь можно поиграться без какой-либо конкретной цели. Вы можете делать всё, что захотите, исследовать регион, построить базовый лагерь и несколько ботов, запускать различные исследовательские программы, убивать насекомых, если вы их найдете раньше чем они найдут вас, и т.д.

source: <a command>Controls</a>.
ru: <a command>Управление</a>.

source: The photograph of the nebula NGC3606 illuminating the sky on Orpheon and the installation program was taken with the Hubble space telescope. It is used with the permission of the authors Wolfgang Brandner (JPL/IPAC), Eva K. Grebel (Washington University), You-Hua Chu (Illinois Urbana-Champaign University) and NASA.
ru: Фотография туманности NGC3606, освещающее небо на Орфеоне, и программа установки были сделаны с помощью космического телескопа Хаббла. Она используется с разрешения авторов Вольфганга Бранднера (JPL/IPAC), Евы К. Гребель (Вашингтонский университет), Ю-Хуа Чу (Иллинойсский университет Урбана-Шампейн) и NASA.

source: The thunder sound on Orpheon is used by limited permission from CREATIVE.
ru: Звук грома на Орфеоне используется с ограниченным правом от CREATIVE.

source: Navigation
ru: Навигация

source: The three buttons on the upper left-hand corner of the screen allow you to navigate in the different texts of the help file:
ru: Три кнопки в верхнем левом углу экрана позволяют перемещаться по тексту справки:

source: <button 30/> Home Get back to the home page, i.e. the first page that was displayed, for example when you hit the <format key><key help/></format> or <format key><key prog/></format> key.
ru: <button 30/> Домой Возвращает на домашнюю страницу, то есть на первую показанную страницу, например, когда вы нажимаете <format key><key help/></format> или <format key><key prog/></format> клавиши.

source: <button 55/> Previous Get back to the previous page, i.e. the page that was displayed before you clicked on a link.
ru: <button 55/> Назад Возвращает на предыдущую страницу, то есть страницу, которая отображалась до того, как вы нажали ссылку.

source: <button 48/> Next Get again to the next page, after you used the "Home" or "Previous" button.
ru: <button 48/> Далее Вернет на следующую страницу после того, как вы нажали кнопку «Домой» или «Назад».

source: Remark
ru: Комментарий

source: When a button is gray, this means that it can not be used at this precise moment. For example, when you are in the home page, the "Home" button is gray, because it does not make sense to use it. This remark is valid for all buttons in COLOBOT.
ru: Когда цвет кнопки серый, это означает, что её нельзя использовать в этот момент. Например, когда вы находитесь на домашней странице, серой будет кнопка "Домой", так как в её использовании нет смысла. Этот комментарий может быть применен для всех кнопок игры COLOBOT.

source: Text scrolling
ru: Прокрутка текста

source: If your mouse is equipped with a wheel, you can use it to scroll the text up and down. Otherwise, use the arrow keys and the scroll bar on the right-hand side of the screen.
ru: Если на вашей мышке есть колесо, вы можете использовать его для прокрутки текста вверх или вниз. Если же колеса нет, воспользуйтесь клавишами со стрелками или полосой прокрутки в правой части экрана.

source: Font size
ru: Размер шрифта

source: The cursor on the upper side of the screen allows you to change the font size of the text.
ru: Курсор в верхней части экрана позволяет вам менять размер шрифта.

source: Houston congratulates you in the name of mankind for the success of your mission. The Great Migration to Terra Nova will start very soon.
ru: Хьюстон от имени всего человечества поздравляет Вас с успешным выполнением миссии. Великое Переселение на Терра Нова начнётся очень скоро.

source: Code battles
ru: Битва программ

source: Code battle is a completely new game mode featured in Colobot: Gold Edition. The idea is that you set up two programs (yours and the opponent's) to fight with each other. The player can't interact with the world manually.
ru: Битва программ - это полностью новый игровой режим представленный в Colobot: Gold Edition. Идея в том, что вы устанавливаете две программы (вашу и оппонента) чтобы они сражались друг с другом. Игрок не может взаимодействовать с миром вручную.

source: With the new functions provided in the Gold Edition, you can create a fully automatised base, which does not need any influence from <a object|human>human</a>. All of them are described in the <a cbot>CBOT documentation</a>.
ru: С новыми функциями представленными в Gold Edition, вы можете создать полностью автоматизированную базу, которой не нужно никакое внимание со стороны <a object|human>человека</a>. Все они описаны в <a cbot>Документации CBOT</a>.

source: Production line is explained in Missions and Exercises, but you may want to jump into code battles right away without beating the whole game. So here is a brief description of how the things works in Colobot.
ru: Производственная линия объяснена в Миссиях и Тренировках, но вы можете прямо перейти к Битве программ не нарушая всю игру. Это краткое описание того, как всё работает в Colobot.

source: What you want to achieve
ru: Что вы хотите достичь

source: Basically, you want to destroy the opponent. To do that, you will need something lethal, for example, a robot, specifically, a <a object|botfr>shooter</a>. But you will probably be losing them quite often, so maybe you should keep the production going on. For example, more <a object|botgr>grabbers</a> or more <a object|factory>factories</a>, <a object|convert>converters</a> and so on would be helpful in that. Remember that robots needs <a object|power>batteries</a>. Anyway, before you can start, you must also do some <a object|research>researches</a> to get better technologies. And here we are at the beginning, with a single <a object|botgr>robot</a> and a <a object|titan>Titanium</a>.
ru: В основном, вы хотите уничтожить оппонента. Для этого вам понадобится что-нибудь смертоносное, например, бот, в частности, <a object|botfr>Стрелок</a>. Но вы, вероятно, будете их терять довольно часто, поэтому не стоит останавливать производство. Например, понадобится больше <a object|botgr>Погрузчиков</a> или больше <a object|factory>Фабрик</a>, <a object|convert>Преобразователей</a> и т.д. Помните, что ботам нужны <a object|power>Батареи</a>. В любом случае, вначале, вы должны провести несколько <a object|research>Исследований</a>, чтобы заполучить развитые технологии. И вот мы в самом начале, с единственным <a object|botgr>Ботом</a> и <a object|titan>Титаном</a>.

source: Titanium production
ru: Производство Титана

source: 1. <a cbot|radar>Find</a> a <a object|titan>Titanium</a>. 2. <a cbot|build>Build</a> a <a object|convert>Converter</a>. 3. Find a <a object|titanore>TitaniumOre</a>. 4. Place it in the converter. Move back and wait until the converter is done. 5. Use or move somewhere your new Titanium. Repeat steps 3-5 in order to keep your production going.
ru: 1. <a cbot|radar>Найдите</a> <a object|titan>Титан</a>. 2. <a cbot|build>Постройте</a> <a object|convert>Преобразователь</a>. 3. Найдите <a object|titanore>Руду Титановую</a>. 4. Поместите её в Преобразователь. Отойдите назад и подождите, пока Преобразователь закончит. 5. Используйте или переместите ваш новый Титан. Повторяйте шаги 3-5 чтобы поддерживать ваше производство работающим.

source: Researches
ru: Исследования

source: 1. <a cbot|build>Build</a> a <a object|research>ResearchCenter</a>. 2. Power it with a <a object|power>PowerCell</a>. 3. <a cbot|research>Request</a> a <a cbot|researches>research</a> and wait until the research center is done.
ru: 1. <a cbot|build>Постройте</a> a <a object|research>Центр Иссоедований</a>. 2. Включите с помощью <a object|power>Батареи</a>. 3. <a cbot|research>Выберите</a> <a cbot|researches>Исследование</a> и дождитесь, пока Центр Исследований закончит.

source: Robot production
ru: Производство ботов

source: 1. <a cbot|build>Build</a> a <a object|factory>BotFactory</a>. 2. Place a <a object|titan>Titanium</a> inside and move back. 3. <a cbot|factory>Request</a> a construction of a robot and wait until the bot factory is done. 4. Power the robot with a <a object|power>PowerCell</a>.
ru: 1. <a cbot|build>Постройте</a> <a object|factory>Фабрику Ботов</a>. 2. Поместите <a object|titan>Титан</a> внутрь и отойдите назад. 3. <a cbot|factory>Выберите</a> конструкцию бота и дождитесь, пока Фабрика Ботов закончит. 4. Оживите бота с помощью <a object|power>Батареи</a>.

source: Power cell production
ru: Производство Батареи

source: 1. <a cbot|build>Build</a> a <a object|energy>PowerPlant</a>. 2. Place a <a object|titan>Titanium</a> in it and wait until the power plant is done.
ru: 1. <a cbot|build>Постройте</a> <a object|energy>Энергостанцию</a>. 2. Поместите <a object|titan>Титан</a> внутрь и дождитесь, пока Энергостанция закончит.

source: There is more
ru: Есть ещё

source: There is much more options, but this is the basis. Read documentation, play the game and think creatively to come up with new ideas. Good luck and have fun!
ru: Есть ещё больше опций, это только основные. Прочитайте документацию, играйте в игру и творчески думайте чтобы придумать новые идеи. Удачи и веселья!

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot|programming>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: <code><a cbot|extern>extern</a> </code>Indicate the main function <code><a cbot|if>if</a> </code>Choice structure <code><a cbot|if>else</a> </code>Alternative choice structure <code><a cbot|switch>switch</a> </code>Multiple choice structure <code><a cbot|switch>case</a> </code>One choice <code><a cbot|switch>default</a> </code>Default choice <code><a cbot|for>for</a> </code>Loop structure <code><a cbot|while>while</a> </code>Control structure <code><a cbot|do>do</a> </code>Control structure <code><a cbot|break>break</a> </code>Exit from a loop <code><a cbot|continue>continue</a> </code>Continues the loop <code><a cbot|return>return</a> </code>Exit from a function <code><a cbot|sizeof>sizeof</a> </code>Size of an array
ru: <code><a cbot|extern>extern</a> </code>Показывает главную функцию <code><a cbot|if>if</a> </code>Структура выбора <code><a cbot|if>else</a> </code>Структура альтернативного выбора <code><a cbot|switch>switch</a> </code>Структура множественного выбора <code><a cbot|switch>case</a> </code>Один выбор <code><a cbot|switch>default</a> </code>Выбор по умолчанию <code><a cbot|for>for</a> </code>Структура цикла <code><a cbot|while>while</a> </code>Структура управления <code><a cbot|do>do</a> </code>Структура управления <code><a cbot|break>break</a> </code>Выход из цикла <code><a cbot|continue>continue</a> </code>Продолжает цикл <code><a cbot|return>return</a> </code>Выход из функции <code><a cbot|sizeof>sizeof</a> </code>Размер массива

source: <code><a cbot|space>space</a> </code>Calculates a free space <code><a cbot|flatspace>flatspace</a> </code>Calculates a free, flat space <code><a cbot|topo>topo</a> </code>Returns the altitude of a point <code><a cbot|flatgrnd>flatground</a> </code>Returns radius of a flat area
ru: <code><a cbot|space>space</a> </code>Вычислить свободное пространство <code><a cbot|flatspace>flatspace</a> </code>Вычислить свободное, ровное пространство <code><a cbot|topo>topo</a> </code>Вернуть высоту точки <code><a cbot|flatgrnd>flatground</a> </code>Вернуть радиус ровной области

source: <code><a cbot|grab>grab</a> </code>Picks up an object <code><a cbot|drop>drop</a> </code>Puts down an object <code><a cbot|sniff>sniff</a> </code>Sounds the subsoil <code><a cbot|thump>thump</a> </code>Overturns alien insects <code><a cbot|recycle>recycle</a> </code>Recycles a derelict bot <code><a cbot|shield>shield</a> </code>Extends or withdraws the shield <code><a cbot|fire>fire</a> </code>Fires the cannon <code><a cbot|aim>aim</a> </code>Rotates the cannon <code><a cbot|build>build</a> </code>Builds a building <code><a cbot|canbuild>canbuild</a> </code>Checks if a building can be built <code><a cbot|buildingenabled>buildingenabled</a> </code>Checks if a building can be built in the level
ru: <code><a cbot|grab>grab</a> </code>Брать объект <code><a cbot|drop>drop</a> </code>Поставить объект <code><a cbot|sniff>sniff</a> </code>Произвести подземное сканирование <code><a cbot|thump>thump</a> </code>Перевернуть вражеских насекомых <code><a cbot|recycle>recycle</a> </code>Переработать брошенного бота <code><a cbot|shield>shield</a> </code>Развернуть или свернуть щит <code><a cbot|fire>fire</a> </code>Стрелять из орудия <code><a cbot|aim>aim</a> </code>Повернуть орудие <code><a cbot|build>build</a> </code>Строить здание <code><a cbot|canbuild>canbuild</a> </code>Проверить возможность постройки здания <code><a cbot|buildingenabled>buildingenabled</a> </code>Проверить возможность построить здание на уровне

source: Instructions specific for some <a cbot|object>objects</a>:
ru: Специальные инструкции применяемые к некоторым <a cbot|object>объектам</a>:

source: <code><a cbot|factory>factory</a> </code>Starts construction of a bot <code><a cbot|research>research</a> </code>Starts a research <code><a cbot|takeoff>takeoff</a> </code>Takes off a spaceship <code><a cbot|busy>busy</a> </code>Checks if object is busy
ru: <code><a cbot|factory>factory</a> </code>Начать создание бота <code><a cbot|research>research</a> </code>Начать исследование <code><a cbot|takeoff>takeoff</a> </code>Начать взлёт космического корабля <code><a cbot|busy>busy</a> </code>Проверить занят ли объект

source: Mathematical functions:
ru: Математические функции:

source: <code><a cbot|rand>rand</a> </code>Returns a random value <code><a cbot|pow>pow</a> </code>Returns a power <code><a cbot|sqrt>sqrt</a> </code>Returns a square root <code><a cbot|floor>floor</a> </code>Returns the largest previous integer <code><a cbot|ceil>ceil</a> </code>Returns the smallest following integer <code><a cbot|round>round</a> </code>Returns a rounded number <code><a cbot|trunc>trunc</a> </code>Returns a truncated number <code><a cbot|sin>sin</a> </code>Returns a sine <code><a cbot|cos>cos</a> </code>Returns a cosine <code><a cbot|tan>tan</a> </code>Returns a tangent <code><a cbot|asin>asin</a> </code>Returns an arcus sine <code><a cbot|acos>acos</a> </code>Returns an arcus cosine <code><a cbot|atan>atan</a> </code>Returns an arcus tangent <code><a cbot|atan2>atan2</a> </code>Returns an arcus tangent, has two arguments
ru: <code><a cbot|rand>rand</a> </code>Вернуть случайное число <code><a cbot|pow>pow</a> </code>Вернуть степень числа <code><a cbot|sqrt>sqrt</a> </code>Вернуть квадратный корень <code><a cbot|floor>floor</a> </code>Вернуть предыдущее целое число <code><a cbot|ceil>ceil</a> </code>Вернуть наименьшее следующее целое число <code><a cbot|round>round</a> </code>Вернуть округлённое число <code><a cbot|trunc>trunc</a> </code>Вернуть усечённое число <code><a cbot|sin>sin</a> </code>Вернуть синус <code><a cbot|cos>cos</a> </code>Вернуть косинус <code><a cbot|tan>tan</a> </code>Вернуть тангенс <code><a cbot|asin>asin</a> </code>Вернуть арксинус <code><a cbot|acos>acos</a> </code>Вернуть арккосинус <code><a cbot|atan>atan</a> </code>Вернуть арктангенс <code><a cbot|atan2>atan2</a> </code>Вернуть арктангенс, имеет два аргумента

source: The <a cbot|type>type</a> of a variable appears like that: <format type>type</format>.
ru: <a cbot|type>Тип</a> переменной выглядит следующим образом: <format type>тип</format>.
