Repository: colobot/colobot-data
Catalog: levels/missions/chapter006/level001/po/*.po
Languages: cs

source: Transport
cs: Přeprava

source: Develop your nuclear technology in order to increase your operating range.
cs: Vyzkoumejte jadernou energii, abyste si rozšířili operační oblast.

source: From Mission Control
cs: Zpráva z řídícího střediska

source: You need to retrieve an <a object|tnt>explosive device</a> that has been spotted in a deep valley next to a lake of boiling lava.
cs: Musíte vyzvednout <a object|tnt>výbušninu</a>, kterou jsme objevili v hlubokém údolí vedle jezera vroucí lávy.

source: Because of the high temperatures, reactors no longer function, i.e. flying is impossible. It is a long way there and you should equip your bots with <a object|atomic>nuclear power cells</a>. Nuclear power cells are manufactured from <a object|uranore>uranium ore</a>.
cs: Kvůli vysoké teplotě prostředí přestaly fungovat tryskové motory, tedy nemůžete létat. Dnes Vás čeká dlouhá cesta, takže byste své roboty měli vybavit <a object|atomic>jadernými bateriemi</a>. Jaderné baterie se vyrábí z <a object|uranore>uranové rudy</a>.

source: A more efficient program for the gathering of raw materials is attached to this message.
cs: V příloze této zprávy je efektivnější program pro sběr surovin.

source: A note of warning: the explosive device is extremely volatile. Use extreme caution.
cs: Varování: Výbušnina je extrémně nestabilní. Zacházejte s ní velmi opatrně.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.

source: See also
cs: Užitečné odkazy

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>

source: Satellite Report
cs: Informace ze satelitu

source: Currently in a geo-stationary orbit of Volcano.
cs: Aktuálně na stacionární oběžné dráze Vulkánu.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 84.6C \tab;Atmosphere: CO2, SO2, HCN, HS, CH4, NH3 \tab;Wind: 2.2 mps \tab;Titanium ore: everywhere \tab;Uranium ore: some
cs: \tab;Teplota: 84,6 °C \tab;Atmosféra: CO2, SO2, HCN, HS, CH4, NH3 \tab;Vítr: 2,2 m/s \tab;Titanová ruda: všude \tab;Uranová ruda: trocha

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>

source: \tab;Energy source: everywhere \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Zdroj energie: všude \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>

source: \tab;Detected: reusable derelicts \tab;Detected: unknown organisms \tab; - Danger: ?
cs: \tab;Nalezeno: recyklovatelné vraky \tab;Nalezeno: neznámé organizmy \tab; - Nebezpečí: ?

source: Walkthrough
cs: Návod

source: Start by recharging a <a object|power>regular power cell</a> and power the <a object|research>research center</a>. Use it to research the technology for the building of a <a object|nuclear>nuclear plant</a> <button 170/>.
cs: Nejprve nabijte jednu <a object|power>běžnou baterii</a> a vložte ji do <a object|research>výzkumné stanice</a>. Vyzkoumejte technologii pro stavbu <a object|nuclear>jaderných elektráren</a> <button 170/>.

source: Produce a <a object|botgr>wheeled grabber</a>.
cs: Vyrobte <a object|botgr>pojízdné rameno</a>.

source: Find some <a object|uranore>uranium ore</a> northwest of your position. The nuclear plant will then transform it into <a object|atomic>nuclear power cells</a> of a longer duration.
cs: Na severozápad od Vaší pozice najdete trochu <a object|uranore>uranové rudy</a>. Jaderná elektrárna z ní vyrobí <a object|atomic>jadernou baterii</a> s větší kapacitou.

source: Power a <a object|botfr>wheeled shooter</a> with one of your new nuclear cells. Dispatch it to kill all intruding <a object|spider>spiders</a> along the way.
cs: Jednu jadernou baterii dejte <a object|botfr>pojízdnému kanónu</a> a pošlete ho zlikvidovat všechny <a object|spider>pavouky</a> číhající na cestě.

source: A <a object|radar>radar</a> is optional but could turn out useful to mark the position of the spiders on your mini map.
cs: Jestli postavíte <a object|radar>radar</a> je čistě na Vás, ale mohlo by se Vám hodit, že pavouky uvidíte na minimapě.

source: A wheeled grabber should be part of the expedition. It will both clear the way cluttered with <a object|titanore>titanium ore</a> and bring the <a object|tnt>explosive device</a> back.
cs: Na výpravu byste dále měli poslat i pojízdné rameno. Uvolněte s ním cestu zasypanou <a object|titanore>titanovou rudou</a> a přivezte zpět <a object|tnt>výbušninu</a>.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
