Repository: colobot/colobot-data
Catalog: levels/exercises/chapter004/level002/po/*.po
Languages: ru

source: Radar
ru: Радар

source: Use the radar to find lots of stupid blue crosses.
ru: Используйте радар, чтобы найти множество Крестов Синих.

source: Exercise
ru: Упражнение

source: Let the bot find all the <a object|waypoint>blue crosses</a> on the ground. As soon as the bot passed over one of the crosses, it will disappear. Here is the general principle that you will apply:
ru: Пусть бот найдет на земле все <a object|waypoint>Кресты Синие</a>. Как только бот пройдет над одним из крестов, он исчезнет. Вот общий принцип, который Вы должны применить:

source: Look for a cross
ru: Искать крест

source: If there is none, stop the program.
ru: Если его нет, остановить программу.

source: Calculate the direction of the cross.
ru: Рассчитать направление к кресту.

source: Set the speed of the motors in such a way that they will find their way to the cross.
ru: Установить скорость моторов так, чтобы они могли найти путь к кресту.

source: The program
ru: Программа

source: Use a <code><a cbot|while>while</a></code> loop in order to repeat several instructions over and over:
ru: Используйте цикл <code><a cbot|while>while</a></code>, чтобы повторять несколько инструкций снова и снова:

source: <code>while ( true ) { </code>instructions...<c/> }
ru: <code>while ( true ) { </code>инструкции...<c/> }

source: The instruction <code><a cbot|radar>radar</a></code> will detect the blue crosses and put their description into a variable, for example <code>spot</code>. In this case, <code><a cbot|radar>radar</a>()</code> needs only one parameter, i.e. the category of the object that it must look for:
ru: Инструкция <code><a cbot|radar>radar</a></code> будет искать Кресты Синие и присваивать направление переменной, например <code>spot</code>. В этом случае инструкции <code><a cbot|radar>radar</a>()</code> необходим всего один параметр, т.е. категория объекта, который он должен искать:

source: Once all the crosses have been found, <code>radar</code> will return the value <code><a cbot|null>null</a></code>. You will have to test this case and react accordingly with the instruction <code><a cbot|if>if</a></code>:
ru: Когда будут найдены все кресты, <code>radar</code> возвратит значение <code><a cbot|null>null</a></code>. Вы должны будете всё это проверять и действовать согласно инструкции <code><a cbot|if>if</a></code>:

source: <c/>if ( spot == null ) // no more ? { motor(0, 0); // stops the motors break; // stops the loop }
ru: <c/>if ( spot == null ) // нет ещё ? { motor(0, 0); // остановить моторы break; // остановить цикл }

source: <n/>The instruction <code><a cbot|break>break</a></code> will stop the infinite loop <code>while (true)</code>.
ru: <n/>Инструкция <code><a cbot|break>break</a></code> остановит бесконечный цикл <code>while (true)</code>.

source: Use the instruction <code><a cbot|direct>direction</a>()</code> to calculate the angle of the rotation that the bot must perform in order to turn towards the blue cross. The coordinates of the object are given by <code>spot.position</code>. The following line will put the angle of the necessary rotation into the <a cbot|var>variable</a> <code>dir</code>:
ru: Используйте инструкцию <code><a cbot|direct>direction</a>()</code> чтобы рассчитать угол, на который должен повернуть бот в направлении Креста Синего. Координаты объекта задаются <code>spot.position</code>. Следующие строки присваивают угол необходимого поворота <a cbot|var>переменной</a> <code>dir</code>:

source: The value of the angle is positive if the blue cross is on your left hand, and negative if it is on your right hand. If the cross to be reached is on your left hand, you must set the right-hand motor to full speed, and set the left-hand motor to a lower speed, according to the angle:
ru: Значение угла положительное, если Крест Синий расположен слева от Вас, и отрицательное, если он справа. Если крест расположен слева, Вы должны установить максимальную скорость правостороннего мотора и установить левосторонний мотор на более низкие обороты, в соответствии с углом:

source: direction = <code> 0</code> -> speed = <code> 1.0</code> direction = <code> 45</code> -> speed = <code> 0.5</code> direction = <code> 90</code> -> speed = <code> 0.0</code> direction = <code>135</code> -> speed = <code>-0.5</code> direction = <code>180</code> -> speed = <code>-1.0</code>
ru: направление = <code> 0</code> -> скорость = <code> 1.0</code> направление = <code> 45</code> -> скорость = <code> 0.5</code> направление = <code> 90</code> -> скорость = <code> 0.0</code> направление = <code>135</code> -> скорость = <code>-0.5</code> направление = <code>180</code> -> скорость = <code>-1.0</code>

source: The graphic below shows the speed of the left-hand and right-hand motor as set by the instruction <code><a cbot|motor>motor</a></code>, according to the angle:
ru: График внизу отображает скорость левостороннего и правостороннего мотора, как было задано инструкцией <code><a cbot|motor>motor</a></code>, в соответствии с углом:

source: If the cross is straight ahead, the angle is 0 degrees. The motors will get the speeds 1 and 1, which means full speed ahead. If the cross is behind, the right motor will be set to speed -1: it will turn around. You can use the <a cbot|expr>expression</a> <code>1+dir/90</code> in order to calculate the necessary speed of the motors:
ru: Если крест расположен прямо впереди, угол равен 0 градусов. Моторы будут работать на скорости 1 и 1, что означает полный вперёд. Если крест сзади, правый мотор будет работать на скорости -1: бот развернётся. Вы можете использовать <a cbot|expr>выражение</a> <code>1+dir/90</code> чтобы рассчитывать необходимую скорость моторов:

source: <c/>if ( dir < 0 ) // on the right side? { motor(1, 1+dir/90); // turns more or less }
ru: <c/>if ( dir < 0 ) // на правой стороне? { motor(1, 1+dir/90); // поворачивает более или менее }

source: Use the same principle if the angle has got a positive value, ranging between 0 and 180 degrees. It is up to you to work out the exact instructions to be performed:
ru: Используйте тот же принцип, если угол принимает положительное значение между 0 и 180 градусами. Вы можете использовать или не использовать в точности эти инструкции:

source: <code>else // on the left side? { </code>up to you to fill in here...<c/> }
ru: <code>else // с левой стороны? { </code>здесь идёт код, написанный Вами...<c/> }

source: At the beginning of the program, you must still declare all the variables. <code>spot</code> is of type <code><a cbot|object>object</a></code>, whereas <code>dir</code> is of type <code><a cbot|float>float</a></code>.
ru: В самом начале программы Вы должны объявить переменные. <code>spot</code> относится к типу <code><a cbot|object>object</a></code>, а <code>dir</code> к типу <code><a cbot|float>float</a></code>.

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: Repeat forever:
ru: Повторять всегда:
