Repository: colobot/colobot-data
Catalog: levels/exercises/chapter005/level004/po/*.po
Languages: cs, fr

source: E
fr: F

source: Flying mover
cs: Letecká přeprava
fr: Le déménageur volant

source: Move a titanium cube across obstacles.
cs: Převezte kostku titanu přes překážky.
fr: Déplacer un cube de métal par dessus des obstacles.

source: Mover
cs: Preprava
fr: Déplace

source: Exercise
cs: Cvičení
fr: Exercice

source: Move the <a object|titan>titanium cube</a> on the finishing pad. You do not know the position of the titanium, but we can tell you the position of the finishing pad x=10 and y=-60.
cs: Odvezte <a object|titan>kostku titanu</a> na cílovou značku. Přesnou polohu titanu neznáte, ale prozradíme Vám polohu cílové značky: x=10 a y=-60.
fr: Déplacez le cube de <a object|titan>titanium</a> sur la plate-forme d'arrivée. On ne connaît pas la position du titanium. En revanche, on sait que la plate-forme est à la position x=10 et y=-60.

source: The instruction <code>goto</code>
cs: Příkaz <code>goto</code>
fr: L'instruction <code>goto</code>

source: The winged bot can get across obstacles. The instruction <code><a cbot|goto>goto</a></code>, if performed on a winged bot, will automatically perform a flying move, with a take-off at the beginning, and a landing at the end. This instruction can actually receive a second parameter, which is not compulsory: the flying altitude. If no second parameter is given, the flying altitude will be set to the default value of 10m.
cs: Létající roboti mohou létat přes překážky. Pokud na létajícím robotu zavoláte příkaz <code><a cbot|goto>goto</a></code>, robot při přesunu na delší vzdálenost na začátku automaticky vzlétne a na konci přistane. Tento příkaz navíc přijímá i druhý parametr, který není povinný: letovou výšku. Pokud příkaz zavoláte bez druhého parametru, letová výška se nastaví na výchozí hodnotu 10m.
fr: Le robot volant permet de passer par dessus les obstacles. L'instruction <code><a cbot|goto>goto</a></code> élève les robots volants automatiquement, avec un décollage au début du déplacement et un atterrissage à la fin. En fait, cette instruction peut recevoir un deuxième paramètre optionnel qui est l'altitude de croisière. Mais il n'est même pas obligatoire de le donner, car une altitude de 10 mètres est prise si ce paramètre manque, et bien entendu, si le robot peut voler.

source: Therefore, the instruction: <c/><s/>goto(item.position);<n/>
cs: Tedy následující příkaz: <c/><s/>goto(item.position);<n/>
fr: Donc, l'instruction: <c/><s/>goto(item.position);<n/>

source: Is equivalent to: <c/><s/>goto(item.position, 10);<n/>
cs: Je totožný jako: <c/><s/>goto(item.position, 10);<n/>
fr: Est équivalente à: <c/><s/>goto(item.position, 10);<n/>

source: The program
cs: Program
fr: Solution

source: Use the instruction <c/><a cbot|radar>radar</a>(Titanium);<n/> in order to find the titanium cube. Then test if a titanium cube has actually been found. In this exercise, this line is not very useful, because we know that there is a titanium cube somewhere. However, it is better to take the habit of testing whatever your radar returns:
cs: Najdět kostku titanu pomocí příkazu <c/><a cbot|radar>radar</a>(Titanium);<n/>. Pak zkontrolujte, jestli radar opravdu něco našel. V tomto cvičení je to sice zbytečné, protože předem víme, že tu někde titan je. Ale je lepší si pěstovat zvyk, že výstupy radaru je třeba kontrolovat:
fr: Pour trouver le titanium, utilisez l'instruction <c/><a cbot|radar>radar</a>(Titanium);<n/>. La troisième ligne teste si le titanium est trouvé. Dans cet exercice, c'est inutile, mais il vaut mieux prendre l'habitude de faire ce genre de test systématiquement:

source: object item; item = radar(Titanium); if ( item == null ) return; goto(item.position);
fr: <c/>object item; item = radar(Titanium); if ( item == null ) return; goto(item.position);

source: The variable <code>item</code> is of type <code><a cbot|object>object</a></code>. In order to know the exact location of the object described by the variable, just write <code>item.position</code>.
cs: Proměnná <code>item</code> je typu <code><a cbot|object>object</a></code>. Přesnou polohu objektu popsaného touto proměnnou získáte výrazem <code>item.position</code>.
fr: La variable <code>item</code> est de type <code><a cbot|object>object</a></code>. Pour connaître la position de l'objet décrit par la variable, il faut donc écrire <code>item.position</code>.

source: In order to take the titanium cube, use the instruction <code><a cbot|grab>grab</a>()</code> without any parameter.
cs: Pro zvednutí kostky titanu použijte příkaz <code><a cbot|grab>grab</a>()</code> bez parametrů.
fr: Pour prendre le titanium, il suffit d'effectuer <code><a cbot|grab>grab</a>()</code>, sans aucun paramètre. Pour déposer le titanium, il suffit d'effectuer <code><a cbot|drop>drop</a>()</code>, sans aucun paramètre.

source: In order to drop the titanium, use the instruction <code><a cbot|drop>drop</a>()</code> without any parameter.
cs: Pro položení titanu použijte příkaz <code><a cbot|drop>drop</a>()</code> bez parametrů.
fr: Les coordonnées de la plate-forme d'arrivée sont connues: x=10 et y=-60. Il faut donc déclarer une <a cbot|var>variable</a> de type <a cbot|point>point</a>, puis lui assigner les bonnes coordonnées. Cette variable pourra ensuite être donnée comme argument à l'instruction <code><a cbot|goto>goto</a></code>. Remarque: la coordonnée <code>z</code> peut être ignorée dans le cas d'un robot qui ne vole pas!

source: We know the coordinates of the finishing pad: x=10 et y=-60. You must declare a <a cbot|var>variable</a> of the type <a cbot|point>point</a>, then fill it with the right coordinates. Then you can give this variable as a parameter to the instruction <code><a cbot|goto>goto</a></code>. Remark: You do not have to take care of the <code>z</code> coordinate in the case of a bot that can not fly.
cs: Známe polohu cílové značky: x=10; y=-60. Musíte deklarovat <a cbot|var>proměnnou</a> typu <a cbot|point>point</a> a tyto souřadnice do ní uložit. Pak můžete tuto proměnnou předat jako argument příkazu <code><a cbot|goto>goto</a></code>. Poznámka: Pokud robot neumí létat, nemusíte se starat o souřadnici <code>z</code>.
fr: A vous de terminer le programme ...

source: It is now up to you to finish the program...
cs: Dopsat zbytek programu už je na Vás...
fr: <format key><key help/></format> permet de revoir ces instructions en tout temps!

source: See also
cs: Užitečné odkazy
fr: Voir aussi

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
fr: <a tremova3>Exercice précédent</a> et <a cbot>programmation</a>.
