Repository: colobot/colobot-data
Catalog: levels/missions/chapter007/level001/po/*.po
Languages: cs, pt_br

source: Cloning
cs: Kopírování
pt_br: Le canon orgaShooter

source: Reproduce the technology to manufacture an orga shooter yourself.
cs: Okopírujte technologii pro výrobu biokanónů.
pt_br: Faites les recherches nécessaires pour pouvoir construire des canons orgaShooter.

source: From Mission Control
cs: Zpráva z řídícího střediska
pt_br: Instructions de Houston

source: Find some more <a object|bullet>organic matter</a> and, given an appropriate research program performed by your <a object|labo>autolab</a>, <a object|human>you</a> should be able to manufacture orga shooters yourself.
cs: Najděte další vzorek <a object|bullet>organické hmoty</a> a proveďte nezbytný výzkum v <a object|labo>laboratoři</a>, abyste mohli vyrábět nové biokanóny.
pt_br: Retrouvez de la <a object|bullet>matière organique</a> pour faire dans votre <a object|labo>laboratoire</a> les recherches nécessaires à la construction des canons orgaShooter.

source: Please keep in mind that low energy resources are a major concern on this planet.
cs: Pamatujte, že nedostatek zdrojů energie na této planetě představuje vážnou komplikaci.
pt_br: Nous attirons vous attention sur l'approvisionnement en énergie qui est un problème majeur sur cette planète.

source: <format key><key help/></format> allows you to review these instructions at all times on your personal SatCom <button 63/>.
cs: Tyto instrukce si můžete kdykoliv znovu přečíst na svém osobním SatKomu <button 63/> klávesou <format key><key help/></format>.
pt_br: <format key><key help/></format> permet de revoir ces instructions sur votre SatCom.

source: See also
cs: Užitečné odkazy
pt_br: Voir aussi

source: <a command>Controls</a> and <a cbot>CBOT Language</a>
cs: <a command>Ovládání</a> a <a cbot>jazyk CBOT</a>
pt_br: <a command>Commandes</a>.

source: Satellite Report
cs: Informace ze satelitu
pt_br: Rapport du satellite

source: Currently in a geo-stationary orbit of Centaury.
cs: Aktuálně na stacionární oběžné dráze Kentaura.
pt_br: En orbite géostationnaire autour de Centaury.

source: -> SURFACE<c/>
cs: -> POVRCH<c/>

source: \tab;Temperature: 23.4C \tab;Atmosphere: oxygen, nitrogen, ammonia \tab;Wind: 1.2 mps \tab;Titanium ore: some \tab;Uranium ore: some
cs: \tab;Teplota: 23,4 °C \tab;Atmosféra: kyslík, dusík, čpavek \tab;Vítr: 1,2 m/s \tab;Titanová ruda: trocha \tab;Uranová ruda: trocha
pt_br: \tab;Température: 23.4 degrés \tab;Atmosphère: oxygène, azote, ammoniaque \tab;Vent: 1.2 m/s \tab;Minerai titanium: par endroits \tab;Minerai uranium: par endroits

source: -> SUBSOIL<c/>
cs: -> PODZEMNÍ LOŽISKA<c/>
pt_br: -> SOUS-SOL<c/>

source: \tab;Energy source: none \tab;Titanium ore: none \tab;Uranium ore: none
cs: \tab;Zdroj energie: žádný \tab;Titanová ruda: žádná \tab;Uranová ruda: žádná
pt_br: \tab;Energie: aucune \tab;Minerai titanium: aucun \tab;Minerai uranium: aucun

source: -> ADDITIONAL INFORMATION<c/>
cs: -> DOPLŇUJÍCÍ INFORMACE<c/>
pt_br: -> INFORMATIONS SPECIALES<c/>

source: \tab;Detected: giant ants \tab; - Danger: not immediate \tab;Detected: reusable derelicts
cs: \tab;Nalezeno: obří mravenci \tab; - Nebezpečí: není bezprostřední \tab;Nalezeno: recyklovatelné vraky
pt_br: \tab;Détecté: fourmis géantes \tab; araignées géantes \tab; - Danger: oui, pas imminent

source: Walkthrough
cs: Návod
pt_br: Solution

source: A <a object|botrecy>recycler</a> that will allow you to make your first <a object|titan>titanium cube</a>.
cs: <a object|botrecy>Recyklátor</a>, kterým si vyrobíte první <a object|titan>kostku titanu</a>.
pt_br: Un <a object|botrecy>robot recycleur</a>, qui permet d'obtenir le premier <a object|titan>cube de titanium</a>.

source: A <a object|botgs>legged grabber</a> that is very good at climbing steep slopes.
cs: <a object|botgs>Chodící rameno</a>, které umí šplhat i po prudkých svazích.
pt_br: Un <a object|botgs>robot déménageur à pattes</a>, très utile pour gravir les fortes pentes.

source: A nearly charged <a object|atomic>nuclear power cell</a>.
cs: Skoro plnou <a object|atomic>jadernou baterii</a>.
pt_br: Une <a object|atomic>pile atomique</a> presque pleine.

source: Power the <a object|botgs>legged grabber</a> with the <a object|atomic>nuclear power cell</a>, and use it to carry a <a object|titan>titanium cube</a> to the <a object|base>spaceship</a>. Choose the direct way over the mountains.
cs: <a object|atomic>Jadernou baterii</a> vložte do <a object|botgs>chodícího ramena</a> a odvezte s ním <a object|titan>kostku titanu</a> zpět k <a object|base>raketě</a>. Jeďte přímou čarou přes kopec.
pt_br: Equipez le <a object|botgs>déménageur à pattes</a> de la pile atomique, et faites-lui porter un cube de titanium vers le <a object|base>vaisseau spatial</a> en prenant le chemin direct par les montagnes.

source: Use the titanium to build a <a object|convert>converter</a>. Execute the program <code>CollectTitanium3</code> on the <a object|botgs>legged grabber</a> and you will have plenty of titanium.
cs: Z titanu postavte <a object|convert>konvertor</a>. Na <a object|botgs>chodícím rameně</a> spusťte program <code>CollectTitanium3</code>, a budete mít titanu víc než dost.
pt_br: Vous pourrez alors construire un convertisseur. Puis exécutez le programme <code>ApporteTitanium3</code> sur le <a object|botgs>déménageur à pattes</a> et vous aurez tout le titanium nécessaire.

source: Stop the program, and use the grabber to collect some <a object|uranore>uranium ore</a> in a second small valley to the east. Again, do not take the way of the valley which is crawling with ants, but take the direct way over the mountains.
cs: Vypněte program a pošlete chodící rameno posbírat trochu <a object|uranore>uranové rudy</a> do druhého malého údolí na východě. Opět nejezděte po cestě skrz údolí, která se hemží mravenci, ale jeďte přímou čarou přes hory.
pt_br: Stoppez le programme, et allez chercher du <a object|uranore>minerai d'uranium</a> dans un deuxième creux plus à l'est. Là encore, ne parcourez pas la vallée qui y mène, elle est infestée de fourmis, mais passez par les montagnes.

source: Build a <a object|botfj>winged shooter</a> and power it with a <a object|atomic>nuclear power cell</a>. If you take the pass south-east, you will arrive immediately at the ant nest. Kill all the ants, and bring back a ball of <a object|bullet>organic matter</a> to the <a object|base>spaceship</a>.
cs: Vyrobte <a object|botfj>létající kanón</a> a vložte do něj <a object|atomic>jadernou baterii</a>. Když proletíte průsmykem na jihovýchodě, dostanete se přímo k mravenčímu hnízdu. Zlikvidujte všechny mravence a zpět k <a object|base>raketě</a> přivezte vzorek <a object|bullet>organické hmoty</a>.
pt_br: Construisez un <a object|botfj>shooter volant</a> et équipez-le d'une pile nucléaire. En empruntant le col qui se trouve au sud-est du vaisseau, vous arriverez rapidement vers le nid des fourmis. Eliminez toutes les fourmis, et vous pourrez ramener une bulle de <a object|bullet>matière organique</a> vers la base.

source: Build an <a object|labo>auto-lab</a>, drop the <a object|bullet>organic matter</a> on the platform and click the <button 110/> button in order to develop the blueprints for the orgaShooter cannon.
cs: Postavte <a object|labo>laboratoř</a>, položte <a object|bullet>organickou hmotu</a> na její plošinku a klikněte na tlačítko <button 110/>, abyste spustili vývoj výrobních plánů pro biokanóny.
pt_br: Construisez un <a object|labo>laboratoire</a>, posez-y la <a object|bullet>matière organique</a> et cliquez sur le bouton <button 110/> pour développer les plans pour le canon orgaShooter.

source: Build a <a object|botos>legged orga shooter</a>, bring it aboard and take off.
cs: Vyrobte <a object|botos>chodící biokanón</a>, naložte ho do rakety a odleťte.
pt_br: Lorsque la <a object|bullet>matière organique</a> a été analysée, construisez un <a object|botos>robot orgaShooter à pattes</a>, amenez-le sur votre <a object|base>vaisseau spatial</a> puis décollez.

source: <a command>Controls</a>
cs: <a command>Ovládání</a>
pt_br: <a command>Commandes</a>.

source: You'll find some useful items in a small valley northeast.
cs: V malém údolí na severovýchodě najdete několik užitečných věcí.
pt_br: Dans un creux au nord-est se trouvent plusieurs objets précieux au milieu de ruines:

source: Produce a <a object|botos>legged orga shooter</a> and bring it back aboard your <a object|base>spaceship</a>.
pt_br: Construisez ensuite un <a object|botos>robot orgaShooter à pattes</a> et amenez-le sur le <a object|base>vaisseau</a>.
