Repository: colobot/colobot-data
Catalog: levels/exercises/chapter003/level002/po/*.po
Languages: ru

source: Follow with variables
ru: Следуйте с переменными

source: Use variables in order to store the parameters of the path.
ru: Используйте переменные, чтобы хранить параметры пути.

source: Exercise
ru: Упражнение

source: This exercise is very similar to the previous one. The bot must move exactly in the same way, but when writing the program, you must use a new concept that is extremely important in programming: <a cbot|var>variables</a>. We saw that all the pads are at a distance form each other of 20 meters. And all the rotations performed consist in 90 degree angles. Instead of rewriting the same values over and over again in the program, we can store them in a variable:
ru: Это упражнение очень напоминает предыдущее. Бот должен двигаться точно так же, но при написании программы Вы должны использовать новую концепцию, которая чрезвычайно важна в программировании: <a cbot|var>переменные</a>. Мы видели, что все площадки расположены на расстоянии 20 метров друг от друга. А все углы поворота имели значение 90 градусов. Вместо того, чтобы переписывать те же значения снова и снова, мы можем хранить их в переменной:

source: Instead of: <c/><s/> move(20);
ru: Вместо: <c/><s/> move(20);

source: We write : <c/><s/> dist = 20;
ru: Мы напишем : <c/><s/> dist = 20;

source: Variables
ru: Переменные

source: The name,
ru: Название,

source: The type of the content,
ru: Тип содержания,

source: The content.
ru: Содержание.

source: The name
ru: Название

source: Use the name to refer to a variable. For example, instead of writing <c/>move(20);<n/>, write <c/>move(dist);<n/>: "dist" is the name of the variable. You can choose almost any name for a variable, for example <code>dist</code>, <code>dir</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>nothing_2_grab</code>, etc.
ru: Используйте название, чтобы обращаться к переменной. Например, вместо того, чтобы писать <c/>move(20);<n/>, напишите <c/>move(dist);<n/>: "dist" - это название переменной. Для переменных Вы можете выбирать любое название, например <code>dist</code>, <code>dir</code>, <code>p2</code>, <code>a</code>, <code>x</code>, <code>nothing_2_grab</code>, и т.д.

source: The type
ru: Тип

source: <code><a cbot|int>int</a></code> for a whole number (12, -500, etc.)
ru: <code><a cbot|int>int</a></code> для целого числа (12, -500, и т.д.)

source: <code><a cbot|float>float</a></code> for a real number (3.14, 0.2, -99.98, etc.)
ru: <code><a cbot|float>float</a></code> для действительного числа (3.14, 0.2, -99.98, и т.д.)

source: <code><a cbot|string>string</a></code> for a character string ("Hello!", "Nothing to grab", etc.)
ru: <code><a cbot|string>string</a></code> для строки символов ("Привет!", "Нечего взять", и т.д.)

source: <code><a cbot|point>point</a></code> for the x,y,z-coordinates of a point in space
ru: <code><a cbot|point>point</a></code> для координат точки в пространстве x,y,z

source: <code><a cbot|object>object</a></code> for the information about an object (bot, building, etc.)
ru: <code><a cbot|object>object</a></code> для информации об объекте (бот, здание, и т.д.)

source: The content
ru: Содержание

source: The content of a variable can be a number, a string, coordinates, etc., according to the type of the variable. The content of a variable can change many times during the execution of a program.
ru: Содержание переменной может быть числом, строкой, координатами и т.д., согласно типу переменной. Содержание переменной может изменяться много раз во время выполнения программы.

source: Before you can use a variable, you have to declare it. For example, before you can use the two variables <code>dist</code> and <code>dir</code>, you must declare them with the following lines:
ru: Перед тем, как использовать переменную, Вы должны объявить её. Например, перед тем, как Вы сможете использовать две переменные <code>dist</code> и <code>dir</code>, Вы должны объявить их с помощью следующих строк:

source: Now you can use the two variables. To put the value 20 into <code>dist</code> and 90 into <code>dir</code>, write:
ru: Теперь Вы можете использовать эти две переменные. Чтобы присвоить значение 20 <code>dist</code> и 90 <code>dir</code>, напишите:

source: Now you can move and turn the bot with the instructions <code><a cbot|move>move</a></code> and <code><a cbot|turn>turn</code></a>:
ru: Теперь Вы можете передвигать и поворачивать бот инструкциями <code><a cbot|move>move</a></code> и <code><a cbot|turn>turn</code></a>:

source: You can also use a whole <a cbot|expr>mathematical expression</a> instead of just the variable:
ru: Вы также можете использовать целое <a cbot|expr>математическое выражение</a> вместо переменной:

source: The latter instruction will be needed to turn the bot right.
ru: Крайняя инструкция необходима, чтобы повернуть бот вправо.

source: Now, rewrite the program of the previous exercise, but use a variable for the distance and another variable for the angle of the rotation.
ru: Теперь перепишите программу из предыдущего упражнения с использованием переменной дистанции и другой переменной для задания угла поворота.

source: See also
ru: Смотрите также

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
ru: <a cbot>Программирование</a>, <a cbot|type>типы</a> и <a cbot|category>категории</a>.

source: A <a cbot|var>variable</a> is composed of three elements:
ru: <a cbot|var>Переменная</a> состоит из трёх элементов:

source: The type of a variable determines what kind of information the variable can contain. According to the type, a variable can contain a whole number, a real number, a character string, the coordinates of a point, etc. Here is a list with the most common variable types:
ru: Тип переменной определяет, какую информацию сможет содержать переменная. Согласно типу, переменная может содержать целое число, действительное число, строку символов, координаты точки и т.д. Вот список наиболее распространённых типов переменных:
