Repository: colobot/colobot-data
Catalog: colobot/levels/exercises/chapter003/level005/po/*.po
Languages: fr

source: Exchange posts 2
fr: Bornes 2

source: Collect more valuable information from information exchange posts.
fr: Récolter des informations de direction et de distance, afin d'apprendre le concept de variable.

source: Info
fr: Suivre

source: Exercise
fr: Exercice

source: In this exercise, the <a object|exchange>information exchange posts</a> along the way contain the direction of the next post and the distance. And you do not know how many exchange posts you must get in touch with before arriving at your goal.
fr: 9 <a object|exchange>bornes</a> d'informations sont placées le long d'un chemin. Lorsque le <a object|bottr>robot</a> est proche d'une borne, il peut lire les informations qu'elle contient et qui donnent la direction et la distance jusqu'à la borne suivante.

source: General principle
fr: Principe

source: Retrieve the direction from the <a object|exchange>exchange post</a>.
fr: Lire la direction dans la <a object|exchange>borne</a>.

source: Retrieve the distance from the <a object|exchange>exchange post</a>.
fr: Lire la longueur dans la <a object|exchange>borne</a>.

source: Execute the rotation.
fr: Tourner dans la direction obtenue.

source: Move forward to the next post.
fr: Avancer de la longueur obtenue.

source: This time you need 2 <a cbot|var>variables</a>, one for the rotation angle, one for the distance, for example <code>dir</code> and <code>len</code> :
fr: Il faut définir deux <a cbot|var>variables</a> <code>dir</code> et <code>len</code>:

source: Then you can retrieve the information:
fr: Et ensuite leur assigner la direction à prendre et la longueur à avancer:

source: And move forward:
fr: Puis avancer avec:

source: Remark
fr: Remarque

source: You can click on an <a object|exchange>information exchange post</a> in order to read what information it contains. In this exercise, every exchange post contains two values called <code>"Direction"</code> and <code>"Length"</code>.
fr: En cliquant sur une <a object|exchange>borne</a> pour la sélectionner, vous pouvez voir les paramètres qu'elle contient. Dans cet exercice, chaque borne contient deux informations appelées <code>"Direction"</code> et <code>"Length"</code>.

source: See also
fr: Voir aussi

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
fr: <a texch1>Exercice précédent</a> et <a cbot>programmation</a>.
