Repository: colobot/colobot-data
Catalog: levels/exercises/chapter003/level009/po/*.po
Languages: cs

source: Remote control #1
cs: Dálkové ovládání #1

source: Remote control a robot using an information exchange post, so it will transport uranium ore.
cs: Ovládejte robota na dálku prostřednictvím komunikační stanice, aby převážel uranovou rudu.

source: remote
cs: Ovladac

source: Exercise
cs: Cvičení

source: Remote control a robot using an <a object|exchange>information exchange post</a>, so it will transport <a object|uranore>uranium ore</a>. The main actors of this exercise are:
cs: Ovládejte robota na dálku prostřednictvím <a object|exchange>komunikační stanice</a>, aby převážel <a object|uranore>uranovou rudu</a>. Hlavní role v tomto cvičení hrají:

source: A <a object|botsr>sniffer</a> (can't carry anything).
cs: <a object|botsr>Pojízdný detektor</a> (nemůže nic převážet).

source: An <a object|exchange>information exchange post</a> that receives information from a sender and then transmits it to a receiver.
cs: <a object|exchange>Komunikační stanice</a>, která přijme informace od odesílatele a pošle je příjemci.

source: A <a object|botgr>grabber</a> which waits for orders from the exchange post. You have no way control this robot directly.
cs: <a object|botgr>Pojízdné rameno</a>, které čeká na povely od komunikační stanice. Tohoto robota nemůžete ovládat přímo.

source: tremot1a
cs: tremot1a_cs

source: An information exchange post stores "name/value" couples. To control the "slave" robot we use just one couple:
cs: Do komunikační stanice lze ukládat informace v podobě dvojice "název-hodnota". K ovládání "dělníka" bude stačit jen jedna taková dvojice:

source: name="order", valuer=order number
cs: název="order", hodnota=číslo povelu

source: The slace robot understands following orders:
cs: Dělník rozumí následujícím povelům:

source: 1 -> grab(); // take an object 2 -> drop(); // drop an object 3 -> move(10); // move 10 meters forward 4 -> move(-10); // move 10 meters backwards
cs: 1 -> grab(); // zvednout předmět 2 -> drop(); // položit předmět 3 -> move(10); // popojet o 10 metrů vpřed 4 -> move(-10); // zacouvat o 10 metrů

source: To instruct the slave to move forward 10 meters all you have to do is: <c/><s/> <a cbot|send>send</a>("order", 3, 100); // order 3 -> "move(10)"
cs: Když chcete dělníkovi dát povel, aby popojel o 10 metrů vpřed, stačí napsat toto: <c/><s/> <a cbot|send>send</a>("order", 3, 100); // povel 3 -> "move(10)"

source: After the send instruction we wait for 5 seconds to be sure the move is done. <c/><s/> <a cbot|wait>wait</a>(5);
cs: Po příkazu send počkáme 5 sekund, aby dělník měl čas daný povel vykonat. <c/><s/> <a cbot|wait>wait</a>(5);

source: Remark: There is a better way for waiting the order has been executed, but we'll see this later in exercise "Remote Control #2".
cs: Poznámka: Na vykonání povelu se dá čekat i lepším způsobem, ale to si ukážeme později ve cvičení "Dálkové ovládání #2".

source: To finish the exercise you must:
cs: Pro splnění cvičné úlohy musíte:

source: Take the uranium ore
cs: Zvednout uranovou rudu

source: Move forward by 10 meters
cs: Popojet vpřed o 10 metrů

source: Drop the uranium ore
cs: Položit uranovou rudu

source: Move backwards by 10 meters
cs: Zacouvat o 10 metrů

source: It's up to you to write the program.
cs: Napsat vhodný program už je na Vás.

source: See also
cs: Užitečné odkazy

source: <a cbot>Programming</a>, <a cbot|type>types</a> and <a cbot|category>categories</a>.
cs: <a cbot>Programování</a>, <a cbot|type>datové typy</a> a <a cbot|category>kategorie</a>.
