Repository: colobot/colobot-data
Catalog: colobot/help/programs/po/*.po
Languages: fr

source: Programs dispatched by Houston
fr: Programmes envoyés par Houston

source: Following is a program that has been developed by our engineers. It allows you to switch <a object|power>power cells</a>. A charged cell needs to be placed on the ground in front of the bot.
fr: Voilà un programme développé par nos ingénieurs pour échanger la <a object|power>pile</a> d'un robot, lorsque il est placé devant une pile posée au sol.

source: In order to execute this program, select the program <code>SwitchCell1</code> in the list of the programs available on the bot (on the lower left-hand corner of your screen), and click on the arrow symbol <button 21/>.
fr: Pour exécuter ce programme, sélectionnez <code>EchangePile1</code> dans la liste des programmes disponibles sur le robot (à gauche de l'écran), puis cliquez sur l'icône flèche <button 21/> pour l'exécuter.

source: extern void object::SwitchCell1() { <a cbot|grab>grab</a>(InFront); // take the new cell in front <a cbot|drop>drop</a>(Behind); // and drop it behind <a cbot|grab>grab</a>(EnergyCell); // take the cell from the bot <a cbot|drop>drop</a>(InFront); // and drop it in front <a cbot|grab>grab</a>(Behind); // take the new cell <a cbot|drop>drop</a>(EnergyCell); // and drop it on the bot }
fr: extern void object::EchangePile1() { <a cbot|grab>grab</a>(InFront); // prend pile neuve devant <a cbot|drop>drop</a>(Behind); // et la pose derrière <a cbot|grab>grab</a>(EnergyCell); // prend la pile du robot <a cbot|drop>drop</a>(InFront); // et la pose devant <a cbot|grab>grab</a>(Behind); // prend la pile neuve <a cbot|drop>drop</a>(EnergyCell); // et la met sur le robot }

source: We did not develop a specific program for this mission. However, you can develop your own programs if you think it would be useful.
fr: Nous ne vous avons envoyé aucun programme pour cette mission. A vous de faire ceux qui peuvent vous rendre service!

source: Index of the programs dispatched in former missions:
fr: Résumé des programmes déjà reçus:

source: Below is a program that has been developed by our engineers. It allows you to recharge the <a object|power>power cell</a> of a bot: it goes to the closest <a object|station>power station</a>, waits 5 seconds, and comes back to the initial position.
fr: Nous avons réalisé un programme très simple mais efficace qui recharge la <a object|power>pile</a> d'un robot: il va sur la <a object|station>station de recharge</a> la plus proche, attend 5 secondes, puis revient à la position initiale.

source: Remark: If you click on an element of the program underlined in blue, your SatCom will display a text that explains this element. The texts that follow a double slash <code>//</code> are not part of the program, but are comments that help you to understand the program.
fr: Remarque: Les textes qui suivent une double barre oblique ne sont que des commentaires pour vous aider à comprendre le programme. En cliquant sur un élément du programme souligné en bleu, votre SatCom affiche un texte expliquant l'élément concerné.

source: extern void object::Recharge1() { <a cbot|type>point</a> start; // variable for initial pos. <a cbot|type>object</a> item; // info. about power station start = position; // store initial position item = <a cbot|radar>radar</a>(<a cbot|category>PowerStation</a>); // look for station <a cbot|goto>goto</a>(item.position); // go to the power station <a cbot|wait>wait</a>(5); // wait 5 seconds <a cbot|goto>goto</a>(start); // go back to initial pos. }
fr: extern void object::Recharge1() { <a cbot|type>point</a> depart; // variable pour pos. initiale <a cbot|type>object</a> chose; // info sur la station depart = position; // mémorise position initiale chose = <a cbot|radar>radar</a>(<a object|station>PowerStation</a>); // cherche station <a cbot|goto>goto</a>(chose.position); // va sur la station <a cbot|wait>wait</a>(5); // attend 5 secondes <a cbot|goto>goto</a>(depart); // revient à la pos. initiale }

source: We have improved the recharge program. When it arrives at the <a object|station>power station</a>, the bot does not wait exactly 5 seconds, but only until the <a object|power>power cell</a> is fully charged. After the bot is back at the initial position, it displays a message on the screen.
fr: Nous avons amélioré le programme de recharge. Maintenant, lorsque le robot arrive sur la <a object|station>station de recharge</a>, il n'attend plus un temps fixe de 5 secondes, mais seulement jusqu'à ce que sa <a object|power>pile</a> soit pleine. Une fois que la recharge est terminée et que le robot est revenu à la position initiale, il affiche un message à l'écran.

source: extern void object::Recharge2() { <a cbot|type>point</a> start; // variable for initial pos. <a cbot|type>object</a> item; // info. about power station start = position; // store initial position item = <a cbot|radar>radar</a>(<a cbot|category>PowerStation</a>); // look for station <a cbot|goto>goto</a>(item.position); // go to the power station <a cbot|while>while</a> ( <a cbot|object>energyCell.energyLevel</a> < 1 ) { <a cbot|wait>wait</a>(1); // wait until recharged } <a cbot|goto>goto</a>(start); // go back to initial pos. <a cbot|message>message</a>("Recharge completed"); }
fr: extern void object::Recharge2() { <a cbot|type>point</a> depart; // variable pour pos. initiale <a cbot|type>object</a> chose; // info sur la station depart = position; // mémorise position initiale chose = <a cbot|radar>radar</a>(<a object|station>PowerStation</a>); // cherche station <a cbot|goto>goto</a>(chose.position); // va sur station de recharge <a cbot|while>while</a> ( <a cbot|object>energyCell.energyLevel</a> < 1 ) { <a cbot|wait>wait</a>(1); // attend pile pleine } <a cbot|goto>goto</a>(depart); // retourne à la pos. initiale <a cbot|message>message</a>("Recharge terminée"); }

source: Below is one of the programs that has been developed by our engineers. It instructs a <a object|botgr>grabber</a> to retrieve the nearest chunk of <a object|titanore>titanium ore</a> and place it on the <a object|convert>converter</a>.
fr: Voilà un programme développé par nos ingénieurs pour les <a object|botgr>robots déménageurs</a>. Le robot va chercher le <a object|titanore>minerai de titanium</a> le plus proche puis le dépose sur le <a object|convert>convertisseur</a>.

source: In order to execute this program, select the program <code>CollectTitanium1</code> in the list of the programs available on the bot (on the lower left-hand corner of your screen), and click on the arrow symbol <button 21/>. At any moment you can stop the program and take over at the controls with the stop button <button 8/>.
fr: Pour exécuter ce programme, sélectionnez-le dans la liste des programmes disponibles sur le robot (à gauche de l'écran), puis cliquez sur l'icône flèche <button 21/> pour l'exécuter. Vous pouvez à tout moment arrêter le programme avec le bouton stop <button 8/> pour reprendre le contrôle.

source: extern void object::CollectTitanium1() { // 1) Variable definition. <a cbot|type>object</a> item; // info. about objects // 2) Go to the titanium ore and grab it. item = <a cbot|radar>radar</a>(<a cbot|category>TitaniumOre</a>);// look for titanium ore <a cbot|goto>goto</a>(item.position); // go to the position <a cbot|grab>grab</a>(); // grab the titanium // 3) Go to the converter and drop it. item = <a cbot|radar>radar</a>(<a cbot|category>Converter</a>); // look for converter <a cbot|goto>goto</a>(item.position); // go to the position <a cbot|drop>drop</a>(); // drop the titanium <a cbot|move>move</a>(-2.5); // step back 2.5 m }
fr: extern void object::ApporteTitanium1() { // 1) Définition des variables. <a cbot|type>object</a> chose; // déclaration de variable // 2) Va vers le minerai et le prend. chose = <a cbot|radar>radar</a>(<a object|titanore>TitaniumOre</a>);// cherche le minerai <a cbot|goto>goto</a>(chose.position); // va à la position <a cbot|grab>grab</a>(); // prend le titanium // 3) Va vers le convertisseur et pose le minerai. chose = <a cbot|radar>radar</a>(Converter);// cherche le convertisseur <a cbot|goto>goto</a>(chose.position); // va à la position <a cbot|drop>drop</a>(); // pose le titanium <a cbot|move>move</a>(-2.5); // recule de 2.5m }

source: Below is one of the programs that has been developed by our engineers. An upgrade on the previous program: the <a object|botgr>grabber</a>, on its way back from the converter, makes a stop, if necessary, at the <a object|station>power station</a> to recharge its power cell.
fr: Voilà une version améliorée du programme précédent. En effet, le robot refait le plein d'énergie sur une <a object|station>station de recharge</a> après avoir déposé le minerai, si nécessaire.

source: This program also works on <a object|botgj>winged grabbers</a>, if the <a object|derrick>derrick</a> is on another island than the <a object|convert>converter</a>.
fr: Ce programme fonctionne aussi avec des <a object|botgj>déménageurs volants</a>, dans le cas où le <a object|derrick>derrick</a> serait sur une autre île que le <a object|convert>convertisseur</a>.

source: extern void object::CollectTitanium2() { // 1) Variable definition. <a cbot|type>object</a> item; // info. about objects // 2) Go to the titanium ore and grab it. item = <a cbot|radar>radar</a>(<a cbot|category>TitaniumOre</a>);// look for titanium ore <a cbot|goto>goto</a>(item.position); // go to the position <a cbot|grab>grab</a>(); // grab the titanium // 3) Go to the converter and drop it. item = <a cbot|radar>radar</a>(<a cbot|category>Converter</a>); // look for converter <a cbot|goto>goto</a>(item.position); // go to the position <a cbot|drop>drop</a>(); // drop the titanium <a cbot|move>move</a>(-2.5); // step back 2.5 m // 4) If power cell half empty, recharges. if ( energyCell.energyLevel < 0.5 ) { // if so: item = <a cbot|radar>radar</a>(<a cbot|category>PowerStation</a>); // look for station <a cbot|goto>goto</a>(item.position); // go there <a cbot|wait>wait</a>(5); // wait } }
fr: extern void object::ApporteTitanium2() { // 1) Définition des variables. <a cbot|type>object</a> chose; // déclaration variable // 2) Va vers le minerai et le prend. chose = <a cbot|radar>radar</a>(<a cbot|category>TitaniumOre</a>); // cherche le minerai <a cbot|goto>goto</a>(chose.position); // va à la position <a cbot|grab>grab</a>(); // prend le titanium // 3) Va vers le convertisseur et pose le minerai. chose = <a cbot|radar>radar</a>(<a cbot|category>Converter</a>); // cherche convertisseur <a cbot|goto>goto</a>(chose.position); // va à la position <a cbot|drop>drop</a>(); // pose le titanium <a cbot|move>move</a>(-2.5); // recule de 2.5 m. // 4) Si pile à moitié déchargée, va recharger. if ( <a cbot|object>energyCell.energyLevel</a> < 0.5 ) { // si oui: chose = <a cbot|radar>radar</a>(<a cbot|category>PowerStation</a>); // cherche station <a cbot|goto>goto</a>(chose.position); // va recharger <a cbot|wait>wait</a>(5); // attend } }

source: Execute the program <code>KillAnt1</code> immediately on your <a object|botfr>wheeled shooter</a>, it will protect your west flank. Meantime you can elaborate your defense strategy.
fr: Vue l'urgence de la situation, nous avons rédigé un petit programme pour votre <a object|botfr>robot shooter</a>, afin qu'il protège votre flan ouest.

source: extern void object::KillAnt1() { <a cbot|type>object</a> item; // info. about object <a cbot|goto>goto</a>(-30, 0); // go west <a cbot|aim>aim</a>(0); // aim straight <a cbot|while>while</a> ( true ) // repeat forever: { item = <a cbot|radar>radar</a>(<a cbot|category>AlienAnt</a>, 0, 360, 0, 40); <a cbot|if>if</a> ( item != null ) // ant detected ? { <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(item.position)); <a cbot|fire>fire</a>(0.5); // shoot 0.5 s } <a cbot|wait>wait</a>(1); // wait 1 second } }
fr: extern void object::TueFourmi1() { <a cbot|type>object</a> chose; // déclaration variable <a cbot|goto>goto</a>(-30, 0); // va à l'ouest <a cbot|aim>aim</a>(0); // met le canon droit <a cbot|while>while</a> ( true ) // répète toujours: { chose = <a cbot|radar>radar</a>(<a object|ant>AlienAnt</a>, 0, 360, 0, 40); <a cbot|if>if</a> ( chose!= null ) // détecté fourmi? { <a cbot|turn>turn</a>(<a cbot|direct>direction</a>(chose.position)); <a cbot|fire>fire</a>(0.5); // tire 0.5s } <a cbot|wait>wait</a>(1); // attend 1s } }

source: As you will need lots of titanium for this mission, we have made the program <code>CollectTitanium</code> still more efficient. It gathers a whole series of titanium cubes on a free surface, so you can let it work on its own. It also recharges itself at the <a object|station>power station</a> if necessary.
fr: Comme vous aurez beaucoup à construire, nous avons amélioré le programme <code>ApporteTitanium</code>. Le robot répartit maintenant toute une série de <a object|titan>cubes de titanium</a> autour du <a object|convert>convertisseur</a>. Ainsi vous n'avez plus à vous occuper de lui. Il va aussi se <a object|station>recharger</a> tout seul.

source: extern void object::CollectTitanium3() { // 1) Variable definition. <a cbot|type>object</a> item; // info. about objects <a cbot|while>while</a> (true) // repeat forever { // 2) Go to the titanium ore and grab it. item = <a cbot|radar>radar</a>(<a cbot|category>TitaniumOre</a>);// look for titanium <a cbot|goto>goto</a>(item.position); // go to the position <a cbot|grab>grab</a>(); // grab the titanium // 3) Go to the converter and drop it. item = <a cbot|radar>radar</a>(<a cbot|category>Converter</a>); // look for converter <a cbot|goto>goto</a>(item.position); // go to the position <a cbot|drop>drop</a>(); // drop the titanium <a cbot|move>move</a>(-2.5); // step back 2.5 m // 4) Wait until titanium converted and grab it <a cbot|do>do</a> { <a cbot|wait>wait</a>(1); // wait for cube item = <a cbot|radar>radar</a>(<a cbot|category>Titanium</a>, 0, 45, 0, 5); } <a cbot|while>while</a> ( item == null ); <a cbot|goto>goto</a>(item.position); <a cbot|grab>grab</a>(); // grab it // 5) Drop on a free space <a cbot|goto>goto</a>(<a cbot|space>space</a>(position)); // go to free space <a cbot|drop>drop</a>(); // drop titanium // 6) If power cell half empty, recharges. <a cbot|if>if</a> ( energyCell.energyLevel < 0.5 ) { // if so: item = <a cbot|radar>radar</a>(<a cbot|category>PowerStation</a>); <a cbot|if>if</a> ( item != null ) // station found ? { <a cbot|goto>goto</a>(item.position); // go there <a cbot|while>while</a> ( energyCell.energyLevel < 1 ) { // until recharged: <a cbot|wait>wait</a>(1); // wait } } } } }
fr: extern void object::ApporteTitanium3() { <a cbot|type>object</a> chose; // info sur objet <a cbot|while>while</a> ( true ) // répète: { chose = <a cbot|radar>radar</a>(<a cbot|category>TitaniumOre</a>); // cherche minerai <a cbot|goto>goto</a>(chose.position); // va vers minerai <a cbot|grab>grab</a>(); // prend minerai chose = <a cbot|radar>radar</a>(<a cbot|category>Converter</a>); // cherche convert. <a cbot|goto>goto</a>(chose.position); // va sur convert. <a cbot|drop>drop</a>(); // pose minerai <a cbot|move>move</a>(-2.5); // recule 2.5m do { <a cbot|wait>wait</a>(1); // attend le cube chose = <a cbot|radar>radar</a>(<a cbot|category>Titanium</a>, 0, 45, 0, 5); } <a cbot|while>while</a> ( chose == null ); <a cbot|goto>goto</a>(chose.position); <a cbot|grab>grab</a>(); // prend le cube <a cbot|goto>goto</a>(<a cbot|space>space</a>(position)); // va où déposer <a cbot|drop>drop</a>(); // dépose titanium // Pile à moitié vide? <a cbot|if>if</a> ( energyCell.energyLevel < 0.5 ) { chose = <a cbot|radar>radar</a>(<a cbot|category>PowerStation</a>); <a cbot|if>if</a> ( chose!= null ) // station trouvée? { <a cbot|goto>goto</a>(chose.position); // va recharger <a cbot|while>while</a> ( <a cbot|object>energyCell.energyLevel</a> < 1 ) { <a cbot|wait>wait</a>(1); // attend pile pleine } } } } }

source: We have developed a program that takes care of recharging the power cell of a <a object|tower>defense tower</a>:
fr: Nous vous avons envoyé un programme qui s'occupe de recharger la <a object|power>pile</a> d'une <a object|tower>tour de défense</a>.

source: Go to a <a object|tower>defense tower</a>.
fr: Va vers une <a object|tower>tour de défense</a>

source: Wait until the <a object|power>power cell</a> is 80% empty.
fr: Attend que la <a object|power>pile</a> soit à 80% vide pour la prendre.

source: Grab the <a object|power>power cell</a> and recharge it on a <a object|station>power station</a>.
fr: Va la recharger sur une <a object|station>station de recharge</a>.

source: Put it back on the <a object|tower>defense tower</a>.
fr: Revient la mettre sur la tour.

source: Build the <a object|station>power station</a> as close as possible to the tower in order to reduce the time when the tower has got no power cell. A good trick is to place a power cell on the ground in front of the tower. The wasp will attack the power cell, and if the first shoot misses or a wasp arrives when the defense tower has got no energy, only the power cell is destroyed and not the defense tower.
fr: Construisez la station de recharge aussi près que possible de la tour pour limiter le temps où la tour est inactive.

source: extern void object::ServiceTower1() { <a cbot|object>object</a> tower; // info. about tower <a cbot|object>object</a> station; // info. about station // 1) go to the defense tower tower = <a cbot|radar>radar</a>(DefenseTower); // look for tower <a cbot|goto>goto</a>(tower.position); // go there <a cbot|while>while</a> ( true ) // repeat forever { // 2) wait until power cell is empty <a cbot|while>while</a> ( tower.energyCell.energyLevel > 0.2 ) { <a cbot|wait>wait</a>(2); } <a cbot|grab>grab</a>(); // grab the power cell // 3) go to the power station to recharge station = <a cbot|radar>radar</a>(PowerStation); <a cbot|goto>goto</a>(station.position); // go there <a cbot|while>while</a> ( load.energyLevel < 1 ) { <a cbot|wait>wait</a>(1); // wait until recharged } // 4) go back to defense tower <a cbot|goto>goto</a>(tower.position); // go to tower <a cbot|drop>drop</a>(); // drop the power cell } }
fr: extern void object::ServiceTour1() { <a cbot|object>object</a> tour; // info sur tour <a cbot|object>object</a> station; // info sur station tour = <a cbot|radar>radar</a>(<a cbot|category>DefenseTower</a>); // cherche une tour <a cbot|goto>goto</a>(tour.<a cbot|object>position</a>); // va vers tour <a cbot|while>while</a> ( true ) // répète toujours: { // attend que la pile se vide <a cbot|while>while</a> ( tour.<a cbot|object>energyCell.energyLevel</a> > 0.2 ) { <a cbot|wait>wait</a>(2); } <a cbot|grab>grab</a>(); // prend pile // va vers une station de recharge station = <a cbot|radar>radar</a>(<a cbot|category>PowerStation</a>); <a cbot|goto>goto</a>(station.<a cbot|object>position</a>); // va vers station <a cbot|while>while</a> ( <a cbot|object>load.energyLevel</a> < 1 ) { <a cbot|wait>wait</a>(1); // attend recharge } // va vers la tour de défense <a cbot|goto>goto</a>(tour.<a cbot|object>position</a>); // va vers tour <a cbot|drop>drop</a>(); // dépose pile } }

source: According to the data transmitted by the satellite, our engineers have developed two programs. The first one guides the <a object|botshld>shielder bot</a> through the narrow valley north close to the place where the key has been located. You can follow it without fearing any attack:
fr: Voilà deux programmes développés par nos ingénieurs, en fonction des données récoltées par le satellite. Le premier amène le <a object|botshld>robot bouclier</a> à travers le passage étroit vers le nord. Vous pourrez ainsi le suivre en étant à l'abri de toute attaque:

source: extern void object::Outward() { <a cbot|shield>shield</a>(1,15); // activate the shield <a cbot|goto>goto</a>(6,160); // go close to the key <a cbot|shield>shield</a>(0,15); // deactivate the shield }
fr: extern void object::Aller() { shield(1,15); // active le bouclier goto(6,160); // va à la position indiquée shield(0,15); // désactive le bouclier }

source: The second program guides the <a object|botshld>shielder bot</a> back to the <a object|base>spaceship</a>:
fr: Le deuxième programme redescend le <a object|botshld>robot bouclier</a> en direction du <a object|base>vaisseau</a>:

source: extern void object::Return() { <a cbot|shield>shield</a>(1,15); // activate the shield <a cbot|goto>goto</a>(8,60); // go to the spaceship <a cbot|shield>shield</a>(0,15); // deactivate the shield }
fr: extern void object::Retour() { shield(1,15); // active le bouclier goto(8,60); // va à la position indiquée shield(0,15); // désactive le bouclier }

source: Below is a program that has been developed by our engineers.
fr: Voilà un programme développé par nos ingénieurs.

source: It instructs the <a object|botshld>shielder</a> to follow and protect the <a object|botphaz>phazer</a>.
fr: Il permet au <a object|botshld>robot bouclier</a> de suivre et de protéger le <a object|botphaz>robot phazer</a>.

source: extern void object::FollowPhazer() { <a cbot|type>object</a> item; // info. about phazer <a cbot|type>point</a> dest; // position where to go <a cbot|type>float</a> dist; // distance to phazer item = <a cbot|radar>radar</a>(<a cbot|category>PhazerShooter</a>); <a cbot|if>if</a> ( item == null ) { <a cbot|message>message</a>("No phazer found"); <a cbot|return>return</a>; // stop the program } <a cbot|shield>shield</a>(1, 25); // activate the shield <a cbot|while>while</a> ( true ) // repeat forever { item = <a cbot|radar>radar</a>(PhazerShooter);// look for phazer <a cbot|if>if</a> ( item == null ) break; dist = <a cbot|dist>distance</a>(item.position, position); <a cbot|if>if</a> ( dist < 5 ) { // if closer than 5 m: <a cbot|wait>wait</a>(1); // wait } <a cbot|if>else</a> // otherwise: { // Calculate a position 5 m before the phazer dest.x = (item.position.x-position.x)*((dist-5)/dist)+position.x; dest.y = (item.position.y-position.y)*((dist-5)/dist)+position.y; dest.z = (item.position.z-position.z)*((dist-5)/dist)+position.z; <a cbot|goto>goto</a>(dest, 0, 1, 1); // and go there } } }
fr: extern void object::SuivrePhazer() { object item; point dest; float dist; item = radar(PhazerShooter); if ( item == null ) { message("Phazer pas trouvé"); return; } shield(1); // déploie le bouclier while ( true ) { item = radar(PhazerShooter); if ( item == null ) break; dist = distance(item.position, position); if ( dist < 5 ) { wait(1); } else { dest.x = (item.position.x-position.x)*((dist-5)/dist)+position.x; dest.y = (item.position.y-position.y)*((dist-5)/dist)+position.y; dest.z = (item.position.z-position.z)*((dist-5)/dist)+position.z; goto(dest, 0, 1, 1); } } }
