Repository: colobot/colobot-data
Catalog: levels/train2-po/*.po
Languages: fr

source: train200:Ants and wasps
fr: train200:Fourmis et guêpes

source: train200:Fight against moving targets
fr: train200:Combat contre des cibles mouvantes

source: train201:Barrage Fire
fr: train201:Tir de barrage

source: train201:Set the power of the different motors in order to achieve a barrage fire.
fr: train201:Effectuer à l'aide de la commande directe des moteurs un tir de barrage contre des fourmis qui attaquent

source: train201:Move
fr: train201:Barrage

source: train202:Flying tower 1
fr: train202:Tour volante 1

source: train202:Make a flying defense tower out of a winged shooter.
fr: train202:Programmer un robot volant de manière à obtenir une tour de défense volante

source: train202:Move
fr: train202:Tour1

source: train203:Flying Tower 2
fr: train203:Tour volante 2

source: train203:Program a flying tower that wastes less energy.
fr: train203:Une tour de défense volante plus économe en énergie

source: train203:Move
fr: train203:Tour2

source: train204:Fighter Jet 1
fr: train204:Chasseur à réaction 1

source: train204:Instruct a winged shooter to clean the whole region.
fr: train204:Programmez un shooter volant pour qu'il nettoie toute la région

source: train204:Move
fr: train204:Chasseur1

source: train205:Fighter Jet 2
fr: train205:Chasseur à réaction 2

source: train205:Adapt the program to a mountainous terrain.
fr: train205:Adaptez le programme à un relief accidenté

source: train205:Move
fr: train205:Chasseur2

source: train206:Wasp Hunter 1
fr: train206:Chasseur de guêpes 1

source: train206:Shoot down the flying wasps.
fr: train206:Attrapez des guêpes en vol

source: train206:Wasp1
fr: train206:Guêpes1

source: train207:Wasp Hunter 2
fr: train207:Chasseur de guêpes 2

source: train207:Get better at shooting down the wasps.
fr: train207:Attrapez des guêpes de manière plus efficace

source: train207:Wasp2
fr: train207:Guêpes2
